Repository: Cubik65536/arcade_book
Catalog: locale/*/LC_MESSAGES/labs/lab_06_text_adventure/adventure.po
Languages: de

source: Lab 6: Text Adventure
de: Übung 6: Text-Adventure

source: Description of the Adventure Game
de: Beschreibung des Adventures

source: One of the first games I ever played was a text adventure called `Colossal Cave Adventure`_. You can play the game on-line here_ to get an idea what text adventure games are like. Seriously, give it a try. Otherwise it will be hard to understand what we are trying to do here.
de: Eines der ersten Spiele, das ich je gespielt habe, war ein Text-Adventure namens `Colossal Cave Adventure`_. Du kannst das Spiel here_ online spielen, um eine Vorstellung davon zu bekommen, wie Text-Adventures aussehen. Im Ernst, probiere es aus. Ansonsten wird es schwer zu verstehen sein, was wir hier versuchen.

source: Arguably the most famous of this genre of game is the Zork_ series.
de: Die wohl bekanntesten Spiel dieser Art ist die Zork_-Serie.

source: The first "large" program I created myself was a text adventure. It is easy to start an adventure like this. It is also a great way to practice using lists. Our game for this lab will involve a list of rooms that can be navigated by going north, east, south, or west. Each room will be a list with the room description, and then what rooms are in each of the directions. See the section below for a sample run:
de: Das erste "große" Programm, das ich selbst erstellt habe, war ein Text-Adventure. Es ist einfach, ein solches Adventure zu beginnen. Es ist auch eine großartige Möglichkeit, das Verwenden von Listen zu üben. Unser Spiel in dieser Übung beinhaltet eine Liste von Räumen, die nach Norden, Osten, Süden oder Westen navigiert werden können. Jedes Zimmer ist eine Liste mit der Beschreibung des Zimmers und den Zimmern in den jeweiligen Richtungen. Im folgenden Abschnitt findest du einen Beispiellauf:

source: Sample Run
de: Probelauf

source: This game assumes you know the material up through :ref:`intro-to-lists`.
de: Diese Übung setzt voraus, dass du die Kapitel bis zu :ref:`Intro-to-Lists` kennst.

source: Creating Your Dungeon
de: Erstelle dein Dungeon

source: Before you start, sketch out the dungeon that you want to create. It might look something like this:
de: Bevor du beginnst, skizziere das Dungeon, das du erstellen möchtest. Es könnte ungefähr so ​​aussehen:

source: Next, number all of the rooms starting at zero.
de: Als nächstes nummeriere alle Räume beginnend mit Null.

source: Use this sketch to figure out how all the rooms connect. For example, room 0 connects to room 3 to the north, room 1 to the east, and no room to the south and west.
de: Verwende diese Skizze, um herauszufinden, wie alle Räume miteinander verbunden sind. Beispielsweise ist Raum 0 mit Raum 3 im Norden, Raum 1 im Osten und kein Raum im Süden und Westen verbunden.

source: Step-by-step Instructions
de: Schritt für Schritt Anweisungen

source: As a reminder, at the end of the year I do scan for duplicate homework. I keep all homework assignments from prior semesters, and assignments from non-Simpson students that I find on-line. I run a program that scans for duplicates. Make sure your work is your own.
de: Denke daran, das ich Ende des Jahres nach doppelten Hausaufgaben suche. Ich sammele alle Hausaufgaben aus früheren Semestern und Aufgaben von Nicht-Simpson-Studenten, die ich online finde. Ich führe ein Programm aus, das nach Duplikaten sucht. Stelle sicher, dass deine Arbeit *deine* eigene ist.

source: In the ``main`` function, create an empty array called ``room_list``. If you've forgotten, see :ref:`create-an-empty-list`.
de: Erstelle in der ``main``-Funktion ein leeres Array mit dem Namen ``room_list``. Wenn du vergessen hast wie das geht, lies :ref:`create-an-empty-list`.

source: Append this room to the room list. See :ref:`append_to_list` if you've forgotten how to do that.
de: Hänge diesen Raum an die Raumliste an. Siehe :ref:`append_to_list`, wenn du vergessen hast, wie das geht.

source: Create a variable called ``current_room``. Set it to zero.
de: Erstelle eine Variable namens ``current_room``. Setze sie auf Null.

source: Using ``current_room`` and ``room_list``, print the current room the user is in. Since your first room is zero, the output should be the same as before.
de: Mit ``current_room`` und ``room_list`` gibst du den aktuellen Raum aus, in dem sich der Benutzer befindet. Da dein erster Raum 0 ist, sollte die Ausgabe dieselbe sein wie zuvor.

source: Create a variable called ``done`` and set it to ``False``. Then put the printing of the room description in a ``while`` loop that repeats until ``done`` is set to ``True``. We won't set ``done`` to ``True`` yet though.
de: Erstelle eine Variable mit dem Namen ``done`` und setze sie auf ``False``. Füge dann den Ausdruck der Raumbeschreibung in eine ``while``-Schleife ein, die so lange wiederholt wird, bis ``done`` auf ``True`` gesetzt ist. Wir werden ``done`` aber noch nicht auf ``True`` setzen.

source: Before printing the description, add a code to print a blank line. This will make it visually separate each turn when playing the game.
de: Füge vor der Ausgabe der Beschreibung Code hinzu, um eine leere Zeile auszugeben, dadurch wird sie bei jedem Spielzug optisch abgetrennt.

source: After printing the room description, add a line of code that asks the user what they want to do. Use the ``input`` statement. Keep in mind that you will be entering letters, therefore you will *not* want to convert what the user enters to an integer or floating point number. This will be similar to how we got input in :ref:`lab-04`. The most frequent mistake I've seen students make is to have an ``input`` statement and not capture the return value. See :ref:`capturing_returned_values` if you have this issue.
de: Füge nach der Ausgabe der Raumbeschreibung eine Codezeile hinzu, in der der Benutzer gefragt wird, was er tun möchte. Verwende die Anweisung ``input``. Denke daran, dass du Buchstaben eingeben wirst. Daher möchtest du *nicht*, was der Benutzer eingibt, in eine Ganzzahl oder eine Gleitkommazahl umwandeln. Es wird so ähnlich aussehen, wie wir Eingaben in :ref:`lab-04` erhalten haben. Der häufigste Fehler, den ich bei Studierenden gesehen habe, ist, eine Eingabe-Anweisung zu haben und den Rückgabewert nicht zu erfassen. Siehe :ref:`capturing_returned_values`, wenn du dieses Problem hast.

source: Add an ``if`` statement to see if the user wants to go north. You should accept user input like "n" and "N" and "North" and "NoRtH". You may need to review :ref:`text-comparisons` and :ref:`multi-text-comparisons`.
de: Füge eine ``if``-Anweisung hinzu, um festzustellen, ob der Benutzer nach Norden gehen möchte. Du solltes Benutzereingaben wie "n" und "N" sowie "Nord" und "NoRd" akzeptieren. Möglicherweise musst du Folgendes wiederholen :ref:`text-comparisons` und :ref:`multi-text-comparisons`.

source: Test your program. Can you go north to a new room?
de: Teste dein Programm. Kannst du nach Norden in einen neuen Raum gehen?

source: Add ``elif`` statements to handle east, south, and west. Add an ``else`` statement to let the user know the program doesn't understand what she typed.
de: Füge ``elif`` -Anweisungen hinzu, um Ost, Süd und West zu behandeln. Füge eine ``else``-Anweisung hinzu, um dem Benutzer mitzuteilen, dass das Programm nicht versteht, was er eingegeben hat.

source: It is a great idea to put blank lines between the code that handles each direction. I don't mean to print a blank line, but actually have blank lines in the code. That way you visually group the code into sections.
de: Es ist eine gute Idee, Leerzeilen in den Programmcode einzufügen, der die einzelnen Richtungen behandelt. Ich meine nicht eine Leerzeile auszugeben, sondern tatsächlich Leerzeilen im Programmcode. Auf diese Weise gruppierst du den Code visuell in Abschnitte.

source: It is a great idea to add comments too, to each section.
de: Es ist eine gute Idee, zu jedem Abschnitt auch Kommentare hinzuzufügen.

source: Test your program. Make sure you have enough of a description that someone running the program will know what direction to go. Don't say "You are in the kitchen." Instead say "You are in the kitchen. There is a door to the north."
de: Teste dein Programm. Stelle sicher, dass du genügend Beschreibungen hast, damit jemand, der das Programm ausführt, weiß, in welche Richtung es gehen soll. Sag nicht "Du bist in der Küche." Sag stattdessen "Sie sind in der Küche. Es gibt eine Tür nach Norden."

source: Add a quit command that ends the game.
de: Füge einen Ende-Kommando hinzu, das das Spiel beendet.

source: Make sure that the program works for upper and lower case commands.
de: Stelle sicher, dass das Programm für Groß- und Kleinschreibung funktioniert.

source: Have the program work if the user types in "north" or "n". Review :ref:`multi-text-comparisons` if needed.
de: Das Programm soll funktionieren, wenn der Benutzer "nord" oder "n" eingibt. Wiederhole :ref:`multi-text-comparisons` falls nötig.

source: Spend a little time to make this game interesting. Don't simply create an "East room" and a "West room." That's boring.
de: Verwende etwas Zeit, um dieses Spiel interessant zu machen. Erstelle nicht einfach einen "Ostraum" und einen "Westraum". Das ist langweilig.

source: Also spend a little time to double check spelling and grammar. Without a word processor checking your writing, it is important to be careful. Pay particular note to:
de: Nehme dir auch ein wenig Zeit, um Rechtschreibung und Grammatik zu überprüfen. Ohne ein Textverarbeitungsprogramm, das deine Texte überprüft, musst du besonders aufmerksam sein. Beachte insbesondere:

source: Do not capitalize room names unless the room name is part of a title. Don't say "You are in the Living Room," because the word "living room" isn't normally capitalized.
de: Schreibe Raumnamen in Großbuchstaben. Schreibe nicht "Sie befinden sich im wohnzimmer", da das Wort "Wohnzimmer" in Großbuchstaben geschrieben wird.

source: Use ``\n`` to add carriage returns in your descriptions so they don't print all on one line. Don't put spaces around the ``\n``, or the spaces will print.
de: Verwende ``\n``, um Zeilenumbrüche in deinen Beschreibungen aufzunehmen, damit nicht alles in einer Zeile ausgegeben wird. Setze keine Leerzeichen um das ``\n`` herum, sonst werden die Leerzeichen ausgegeben.

source: Expanding this program into a full game is one of the two options for the final lab in this course.
de: Die Erweiterung dieses Programms zu einem vollständigen Spiel ist eine der beiden Optionen für die abschließende Übung in diesem Kurs.
