Repository: Cubik65536/arcade_book
Catalog: locale/*/LC_MESSAGES/chapters/17_sounds/sounds.po
Languages: de

source: Sound Effects
de: Soundeffekte

source: Adding sound to your game isn't too hard. There are two steps:
de: Das Hinzufügen von Sound zu deinem Spiel ist nicht zu schwierig. Es gibt zwei Schritte:

source: Load the sound
de: Lade den Sound

source: Play the sound
de: Spiele den Sound ab

source: For these examples, I'm using a sound file called ``laser.ogg`` that you can `download here <../../_static/laser.ogg>`_. Make sure you save the file in the same directory as any Python program that tries to use it.
de: Für diese Beispiele verwende ich eine Sounddatei mit dem Namen ``laser.ogg``, die Sie hier herunterladen können `<../../_static/laser.ogg>`_. Stelle sicher, dass du die Datei im selben Verzeichnis wie das Python-Programm speicherst, das versucht, sie zu verwenden.

source: Loading Sounds
de: Laden von Sounds

source: The code below creates a new variable called ``laser_sound``. It calls arcades ``load_sound`` function. It passes the filename of our sound.
de: Der folgende Code erstellt eine neue Variable mit dem Namen ``laser_sound``. Er ruft die Funktion ``load_sound`` auf und übergibt den Dateinamen unseres Sounds.

source: For this to work, you need to have a sound downloaded and named ``laser.ogg`` in the same directory as your Python file. The computer will not find the sound if it is in a different directory.
de: Damit dies funktioniert, musst du die eine Sounddatei mit dem Namen ``laser.ogg`` in dasselbe Verzeichnis wie deine Python-Datei herunterladen. Der Rechner findet den Sound nicht, wenn sie sich in einem anderen Verzeichnis befindet.

source: This loads the sound, but does not play it. We only want to load the sound once. We don't want to load the sound off the disk every time we play it. It can be kept in memory.
de: Dadurch wird der Sound geladen, aber nicht abgespielt. Wir wollen den Sound nur einmal laden. Wir möchten den Sound nicht jedes Mal von der Festplatte laden, wenn wir ihn abspielen. Er kann im Speicher bleiben.

source: Playing Sounds
de: Sounds abspielen

source: The code to play sounds is straight-forward. Just call the ``play_sound`` function, and pass in the variable that we set equal to the sound we loaded:
de: Der Code zum Abspielen von Sounds ist einfach. Rufe einfach die Funktion ``play_sound`` auf und übergebe die Variable, die wir auf den geladenen Sound gesetzt haben:

source: Putting the two together, you might think we could do this to play sounds:
de: Wenn man die beiden zusammenfasst, könnte man denken, wir könnten dies tun, um Sounds abzuspielen:

source: But that doesn't work. The program ends before the sound has a chance to play. The ``play_sound`` button doesn't pause while the sound plays, it returns right away and keeps going. This was a similar issue that we had when we opened a window, and we can solve it the same way:
de: Das geht aber nicht. Das Programm endet, bevor der Sound abgespielt werden kann. Die Funktion ``play_sound`` pausiert nicht, während der Sound abgespielt wird, sie kehrt sofort zurück und das Programm geht weiter. Wir hatten ein ähnliches Problem, als wir ein Fenster öffneten, und wir können es auf dieselbe Weise lösen:

source: For this reason, I recommend loading the sound in the ``__init__`` method of the class that will play the sound.
de: Aus diesem Grund empfehle ich, den Sound in der ``__init__``-Methode der Klasse zu laden, die den Sound abspielen soll.

source: Triggering Sounds
de: Sounds auslösen

source: We want to play the sound when something happens. So this example loads the sound once during the ``__init__``. When the user hits the space bar, that is when we trigger the sound to play.
de: Wir wollen den Sound abspielen, wenn etwas passiert. Also lädt dieses Beispiel den Sound einmal während des ``__init__``. Wenn der Benutzer die Leertaste drückt, wird der Sound ausgelöst.

source: Finding Sounds
de: Sounds finden

source: Great places to find free sounds to use in your program:
de: Tolle Webseiten, um kostenlose Sounds für dein Programm zu finden, sind:

source: `www.freesound.org <http://www.freesound.org/>`_ is ok, but requires a login, which is a pain.
de: `www.freesound.org <http://www.freesound.org/>`_ ist in Ordnung, erfordert aber ein Login, was ziemlich nervt.

source: `Kenney.nl <http://kenney.nl/assets?q=audio>`_ has a few free sound packs you can download, and several that are cheap.
de: `Kenney.nl <http://kenney.nl/assets?q=audio>`_ hat ein paar kostenlose Soundpakete, die du herunterladen kannst, und einige, die man günstig kaufen kann.

source: Sound File Formats
de: Dateiformate für Sounds

source: There are several types of `sound file formats`_ that you can find sounds in:
de: Es gibt verschiedene Arten von Audiodateiformaten (`sound file formats`_), in denen man Sounds finden kann:

source: ``.wav`` - This is a raw "wave" format. The sound is not compressed at all. You do not need a special library to decompress the sound, but the sound file itself can be rather large.
de: ``.wav`` - Dies ist ein rohes "Wave" -Format. Der Sound wird überhaupt nicht komprimiert. Man benötigt keine spezielle Bibliothek, um den Sound zu dekomprimieren, aber die Sounddatei selbst kann ziemlich groß sein.

source: ``.mp3`` - MPEG Layer III Audio (mp3) is one of the most popular compressed sound file formats. This file format is what enabled on-line music to become popular. However some of the compression algorithms have patents on them, making it not as suitable for free software.
de: ``.mp3`` - MPEG Layer III Audio (mp3) ist eines der beliebtesten komprimierten Audiodateiformate. Durch dieses Dateiformat wurde Online-Musik immer beliebter. Einige der Komprimierungsalgorithmen sind jedoch patentiert, so dass sie für freie Software nicht geeignet sind.

source: ``.m4a`` - Apple's file format for compressed, but unprotected audio.
de: ``.m4a`` - Apples Dateiformat für komprimiertes, aber ungeschütztes Audio.

source: ``.ogg`` - A open-source sound file that uses Ogg-Vorbis for compression. A less popular but patent-free method of sound storage.
de: ``.ogg`` - Eine Audiodatei, die Ogg-Vorbis (Open Source) zur Komprimierung verwendet. Eine weniger beliebte, aber patentfreie Methode zur Tonspeicherung.

source: Arcade should be able to play files in either the mp3 or ogg format. If you have issues getting it to work, try converting the sound to a raw wav format.
de: Arcade sollte in der Lage sein, Dateien im MP3- oder Ogg-Format abzuspielen. Konvertiere den Sound in ein rohes WAV-Format, wenn du damit Probleme hast.

source: If you need to convert file formats, or trim a sound file, I suggest using the program Audacity_.
de: Wenn du Dateiformate konvertieren oder eine Audiodatei zuschneiden musst, empfehle ich die Verwendung des Programms Audacity_.
