Repository: Cubik65536/arcade_book
Catalog: locale/*/LC_MESSAGES/chapters/15_window_class/window_class.po
Languages: de

source: Using the Window Class
de: Verwenden der Klasse ``Window``

source: We can use a class to represent our program. The Arcade library has a built-in class that represents a window on the screen. We can create our own child class and override functions to handle:
de: Wir können eine Klasse verwenden, um unser Programm repräsentieren. Die Arcade-Bibliothek verfügt über eine integrierte Klasse, die ein Fenster auf dem Bildschirm darstellt. Wir können unsere eigene Kindklasse erstellen und Funktionen überschreiben, um Folgendes zu erreichen:

source: Start-up and initialization
de: Starten und Initialisierung

source: Drawing the items on our screen
de: Zeichnen der Elemente auf unserem Bildschirm

source: Animating/Updating the positions of items on our screen
de: Animieren/Aktualisieren der Positionen von Elementen auf unserem Bildschirm

source: Responding to the keyboard
de: Auf Tastatureingaben reagieren

source: Responding to the mouse
de: Auf die Mausaktionen reagieren

source: One of the best ways of learning to program is to look at sample code. This chapter has several examples designed to learn how to:
de: Eine der besten Möglichkeiten, das Programmieren zu lernen, ist das Betrachten von Beispielcode. In diesem Kapitel findest du einige Beispiele, anhand derer du Folgendes lernen kannst:

source: Open a window using an object-oriented approach
de: Fenster mit einem objektorientierten Ansatz öffnen

source: Animating objects
de: Objekte animieren

source: Moving objects with the mouse
de: Objekte mit der Maus bewegen

source: Moving objects with the keyboard
de: Objekte mit der Tastatur verschieben

source: Moving objects with the joystick
de: Objekte mit dem Joystick bewegen

source: Creating a Window with a Class
de: Erstellen eines Fensters mit einer Klasse

source: Up to now, we have used a function called ``open_window`` to open a window. Here's the code:
de: Bisher haben wir die Funktion ``open_window`` verwendet, um ein Fenster zu öffnen. Hier ist der Code:

source: We can also create an instance of a class called ``Window`` to open a window. The code is rather straight-forward:
de: Wir können auch ein Exemplar der Klasse ``Window`` erstellen, um ein Fenster zu öffnen. Der Programmcode ist ziemlich einfach:

source: Function calls, and calls to create an instance of an object look very similar. The tell-tale clue that we are creating an instance of an object in the second example is the fact that ``Window`` is capitalized.
de: Funktionsaufrufe und Aufrufe zum Erstellen eines Objekts sehen sehr ähnlich aus. Der verräterische Hinweis darauf, dass wir im zweiten Beispiel eine Instanz eines Objekts erstellen, ist die Tatsache, dass ``Window`` groß geschrieben wird.

source: Extending the Window Class
de: Erweitern der Klasse ``Window``

source: Arcade's ``Window`` class has a lot of built-in methods that are automatically called when needed. Methods for drawing, for responding to the keyboard, the mouse, and more. You can see all the methods by looking at the `Window Class Documentation`_. But by default, these methods don't do anything. We need to change that.
de: Die ``Window``-Klasse von Arcade verfügt über eine Reihe integrierter Methoden, die bei Bedarf automatisch aufgerufen werden: Methoden zum Zeichnen, zum Reagieren auf Tastatur, Maus und mehr. Du kannst alle Methoden in der `Window Class Documentation`_ nachschlagen. Standardmäßig tun diese Methoden jedoch nichts. Das müssen wir ändern.

source: As we learned from the prior chapter, we can extend the functionality of a class by creating a child class. Therefore, we can extend the ``Window`` class by creating a child class of it. I'm going to call my child class ``MyGame``.
de: Wie wir im vorherigen Kapitel kennengelernt haben, können wir die Funktionalität einer Klasse erweitern, indem wir eine Kindklasse erstellen. Daher können wir die Klasse ``Window`` erweitern, indem wir eine Kindklasse davon erstellen. Ich werde meine Kindklasse ``MyGame`` nennen.

source: extending_window_class.py
de: extension_window_class.py

source: Drawing with the Window Class
de: Zeichnen mit der Klasse ``Window``

source: To draw with the ``Window`` class, we need to create our own method called ``on_draw``. This will override the default ``on_draw`` method built into the ``Window`` class. We will put our drawing code in there.
de: Um mit der Klasse ``Window`` zu zeichnen, müssen wir unsere eigene Methode ``on_draw`` erstellen. Diese überschreibt die Standardmethode ``on_draw``, die in die Klasse ``Window`` eingebaut ist. Wir werden unseren Code zum Zeichnen dort einfügen.

source: The ``on_draw`` method gets called about 60 times per second. We'll use this fact when we do animation.
de: Die Methode ``on_draw`` wird ungefähr 60 mal pro Sekunde aufgerufen. Wir werden diese Tatsache nutzen, wenn wir die Bilder animieren.

source: We also need to set the background color. Since we only need to do this once, we will do that in the ``__init__`` method. No sense setting the background 60 times per second when it isn't changing.
de: Wir müssen auch die Hintergrundfarbe einstellen. Da wir das nur einmal machen müssen, setzen wir sie in der ``__init__``-Methode. Es ergibt keinen Sinn, den Hintergrund 60 Mal pro Sekunde einzustellen, wenn er sich nicht ändert.

source: The result of this program just looks like:
de: Das Ergebnis dieses Programms sieht so aus:

source: Animating
de: Animieren

source: By overriding the ``update`` method, we can update our ball position and animate our scene:
de: Durch Überschreiben der ``update``-Methode können wir unsere Ballposition aktualisieren und unsere Szene animieren:

source: Encapsulating Our Animation Object
de: Kapselung unseres Animationsobjekts

source: It doesn't take much imagination to realize that adding more parameters to the ball, getting it to bounce, or even having several balls on the screen would make our ``MyApplication`` class very complex.
de: Es braucht nicht viel Vorstellungskraft, um zu begreifen, dass das Hinzufügen weiterer Parameter zum Ball, das Abprallen des Balls oder sogar das Anzeigen mehrerer Bälle auf dem Bildschirm unsere Klasse ``MyApplication`` sehr komplex machen würde.

source: If only there was a way to encapsulate all that "ball" stuff together. Wait! There is! Using classes!
de: Wenn es nur eine Möglichkeit gäbe, all das ``Ball``-Zeug zusammenzufassen. Warte! Es gibt sie! Verwende Klassen!

source: Here is a more complex example, but all the logic for the ball has been moved into a new ``Ball`` class.
de: Hier ist ein komplexeres Beispiel, aber die gesamte Logik für den Ball wurde in eine neue Klasse ``Ball`` verschoben.

source: Here it is in action:
de: Hier ist es in Aktion:

source: Animating a List
de: Eine Liste animieren

source: Wouldn't it be nice to animate multiple items? How do we track multiple items? With a list! This takes our previous example and animates three balls at once.
de: Wäre es nicht schön, mehrere Objekte zu animieren? Wie verfolgen wir mehrere Objekte? Mit einer Liste! In diesem Beispiel werden drei Bälle gleichzeitig animiert.
