Repository: Cubik65536/arcade_book
Catalog: locale/*/LC_MESSAGES/labs/lab_01_first_program/first_program.po
Languages: de

source: Lab 1: First Program
de: Übung 1: Ein erstes Programm

source: Follow these step-by-step instructions. Note that a lot of the instructions link to a different site. I'd recommend opening those links in a different tab on your browser. That way you don't lose your spot on what lab step you are on.
de: Folge diesen Anweisungen schrittweise. Beachte, dass eine Menge der Anweisungen auf eine andere Seite verweisen. Ich empfehle dir diese Links in einem anderen Tab in deinem Browser zu öffnen, dadurch verlierst du nicht die Position, an der du dich in dieser Übung befindest.

source: If you are installing on your own computer:
de: Wenn du auf deinem eigenen Rechner installierst:

source: Install Python and set up the libraries. See :ref:`installing-python`.
de: Installiere Python und richte die Bibliotheken ein. Siehe :ref:`installing-python`.

source: Install PyCharm. See :ref:`installing-pycharm`.
de: Installiere PyCharm. Siehe :ref:`installing-pycharm`.

source: Install Git. See :ref:`installing-git`.
de: Installiere Git. Siehe :ref:`installing-git`.

source: Fork the repository. See :ref:`fork-repository`.
de: Forke das Repository. Siehe :ref:`fork-repository`.

source: Clone the repository. See :ref:`clone-repository`.
de: Clone das Repository. Siehe :ref:`clone-repository`.

source: Open your project in PyCharm. See :ref:`open-in-pycharm`.
de: Öffne dein Projekt in PyCharm. Siehe :ref:`open-in-pycharm`.

source: Try changing a file. See :ref:`change_file`.
de: Versuche eine Datei zu ändern. Siehe :ref:`change_file`.

source: Commit and push the updated program to BitBucket. See :ref:`commit`.
de: Commit und push das aktualisierte Programm auf BitBucket. Siehe :ref:`commit`.

source: Great! Now let's try programming something. Create and run a test program that prints ``Hello``. See :ref:`print-hello-world`. Make sure you take the time to learn how to "run" the program and see the output.
de: Großartig! Lass uns jetzt versuchen, etwas zu programmieren. Erstelle und starte ein Testprogramm, das ``Hallo`` ausgibt. Siehe :ref:`print-hello-world`. Nimm dir die Zeit zu lernen, wie man ein Programm "startet" und sieh dir die Ausgabe an.

source: Update your program to print something longer. Commit and push again. See :ref:`print-multiple-lines`.
de: Aktualisiere dein Programm so, dass etwas Längeres ausgibt. Commit und push wieder. Siehe :ref:`print-multiple-lines`.

source: Now is the time to work on Lab 01. Make sure you are working in the Lab 01 folder, with the ``lab_01.py`` file.
de: Jetzt wird es Zeit an Übung 1 zu arbeiten. Stelle sicher, dass du im Ordner Lab 01 mit der Datei ``lab01.py`` arbeitest.

source: Try running your lab. If you see the old "test" program running instead, right click on your program and tell it you want it to run ``lab_01.py`` not the other program.
de: Versuch deine Übung zu starten. Wenn das alte "test" Programm stattdessen läuft, rechtsklicke auf dein Programm und sage ihm, dass es ``lab_01.py`` und nicht das andere Programm starten soll

source: Commit and push your lab.
de: Commit und push deine Übung.

source: Before turning in your program, double-check:
de: Bevor du dein Programm abgibst, überprüfe noch einmal:

source: Did you put the code in ``lab_01.py`` in the Lab 1 folder?
de: Hast du den Code in ``lab_01.py`` im Ordner Lab 1?

source: Did you remove the sample prints shown above, and make up your own print statements? At least four lines?
de: Hast du die Beispielausgaben von oben entfernt und deine eigenen Ausgabeanweisungen erstellt? Sind es mindestens vier Zeilen?

source: Does the program use proper spelling, capitalization, and grammar in the text that you printed to the screen? (Seriously, make sure what you print out has periods and capital letters.)
de: Verwendet dein Programm korrekte Rechtschreibung, Groß-/Kleinschreibung und Grammatik im ausgegebenen Text? (Ernsthaft, stelle sicher, dass deine Programmausgabe Punkte und Großbuchstaben am Satzanfang und -ende enthält.)

source: Does the program use at least one escape code? Also, remember you don't have to put spaces around escape codes. So do this: ``"\tIndented with a tab"`` not ``"\t Indented with a tab"`` because the space after the t isn't needed unless you want both a tab and an extra space.
de: Verwendet dein Programm wenigstens einen Escape-Code? Denke ebenfalls daran, dass du die Escape-Codes nicht mit Leerzeichen umgeben darfst. Schreibe also: ``\tEingerückt mit einem Tabulator`` und nicht ``\t Eingerückt mit einem Tabulator``, weil das Leerzeichen nach dem t nicht notwendig ist, es sein denn, du willst um einen Tabulator und ein extra Leerzeichen einrücken.

source: Hover over the PyCharm "hints" that are on the right side of your editor to see if there are suggestions on how to make your code better.
de: Lass den Mauszeiger über den "hints" (Hinweisen) auf der rechten Seite des Editors schweben, um nachzusehen, ob es Vorschläge zur Verbesserung des Codes gibt.

source: Have you copied the URL and turned it in to Scholar? (Find the Lab 01 link on Scholar.)
de: Hast du die URL kopiert und auf Scholar abgegeben? (Suche den Lab 01 Link auf Scholar.)

source: Congratulations, you are done!
de: Glückwunsch, du bist fertig!
