Repository: Cubik65536/arcade_book
Catalog: locale/*/LC_MESSAGES/chapters/22_sprites_and_walls/sprites_and_walls.po
Languages: de

source: Sprites and Walls
de: Sprites und Wände

source: Setup
de: Konfiguration

source: Many games with sprites often have "walls" that the character can't move through. There are rather straight-forward to create.
de: Viele Spiele mit Sprites haben oft "Wände", durch die sich die Spielfigur nicht bewegen kann. Sie lassen sich eher unkompliziert erstellen.

source: To begin with, let's get a couple images. Our character, and a box that will act as a blocking wall. Both images are from `kenney.nl`_.
de: Lass uns zunächst mit ein paar Bildern anfangen. Unsere Spielfigur und eine Kiste, die als Sperrmauer fungiert. Beide Bilder stammen von `kenney.nl`_.

source: Start with a default file:
de: Beginne mit einem Einstiegsprogramm:

source: sprite_move_walls.py start
de: sprite_move_walls.py - Anfang

source: In the ``__init__`` method, let's create some variables to hold our sprites:
de: Erstellen wir in der ``__init__``-Methode einige Attribute für unsere Sprites:

source: In the ``setup`` method, let's create our sprite lists:
de: In der ``setup`` Methode erstellen wir unsere Sprite-Listen:

source: Then reset the score and create the player:
de: Setze danach die Punktzahl zurück und erstelle die Spielfigur:

source: Then go ahead and draw everything in our ``on_draw``:
de: Dann zeichne alles in unserer Methode ``on_draw``:

source: Run the program and make sure it works.
de: Führe das Programm aus und stelle sicher, dass es funktioniert.

source: Individually Placing Walls
de: Wände individuell platzieren

source: In our ``setup`` method, we can position individual boxes to be used as "walls":
de: In unserer ``setup`` Methode können wir einzelne Boxen positionieren, die als "Wände" verwendet werden:

source: Go ahead and try it out. It should look like:
de: Probiere es einfach aus. Es sollte so aussehen:

source: Full listing below:
de: Vollständiges Listing unten:

source: sprite_move_walls.py Step 2
de: sprite_move_walls.py - Schritt 2

source: Placing Walls With A Loop
de: Wände mit Hilfe einer Schleife platzieren

source: In our ``setup`` method, we can create a row of box sprites using a ``for`` loop. In the code below, our y value is always 350, and we change the x value from 173 to 650. We put a box every 64 pixels because each box happens to be 64 pixels wide.
de: In unserer ``setup`` -Methode können wir eine Reihe von Box-Sprites mit einer ``for``-Schleife erstellen. Im folgenden Code ist unser y-Wert immer 350, und wir ändern den x-Wert von 173 in 650. Wir setzen alle 64 Pixel ein Kästchen, da jedes Kästchen 64 Pixel breit ist.

source: Placing Walls With A List
de: Wände mit einer Liste platzieren

source: You could even create a list of coordinates, and then just loop through that list creating walls:
de: Man kann sogar eine Liste mit Koordinaten erstellen und diese Liste dann einfach durchlaufen und Wände erstellen:

source: sprite_move_walls.py Step 3
de: sprite_move_walls.py - Schritt 3

source: Physics Engine
de: Physik-Engine

source: First, we need to hook the keyboard up to the player:
de: Zuerst müssen wir die Tastatur mit der Spielfigur verknüpfen:

source: Now, we need to add a way to stop the player from running into walls.
de: Jetzt müssen wir eine Möglichkeit hinzufügen, die Spielfigur daran zu hindern, in die Wände hinein zu rennen.

source: The Arcade Library has a built in "physics engine." A physics engine handles the interactions between the virtual physical objects in the game. For example, a physics engine might be several balls running into each other, a character sliding down a hill, or a car making a turn on the road.
de: Die Arcade-Bibliothek verfügt über eine integrierte "Physik-Engine". Eine Physik-Engine verwaltet die Interaktionen zwischen den virtuellen physischen Objekten im Spiel. Zum Beispiel kann eine Physik-Engine aus mehreren Bällen bestehen, die aufeinander treffen, eine Spielfigur, die einen Hügel hinunterrutscht, oder einem Auto, das auf der Straße eine Kurve fährt.

source: Physics engines have made impressive gains on what they can simulate. For our game, we'll just keep things simple and make sure our character can't walk through walls.
de: Physik-Engines haben beeindruckende Fortschritte erzielt, was sie simulieren können. Für unser Spiel werden wir die Dinge einfach halten und sicherstellen, dass unsere Spielfigur nicht durch Wände gehen kann.

source: We'll create variable to hold our physics engine in the ``__init__``:
de: Wir werden ein Attribut für unsere Physik-Engine in ``__init__`` erstellen:

source: We can create the actual physics engine in our ``setup`` method with the following code:
de: Wir können die eigentliche Physik-Engine in unserer ``setup``-Methode mit folgendem Code erstellen:

source: This identifies the player character (``player_sprite``), and a list of sprites (``wall_list``) that the player character isn't allowed to pass through.
de: Dies identifiziert die Spielfigur (``player_sprite``) und eine Liste von Sprites (``wall_list``), die die Spielfigur nicht passieren darf.

source: Before, we updated all the sprites with a ``self.all_sprites_list.update()`` command. With the physics engine, we will instead update the sprites by using the physics engine's update:
de: Vorher haben wir alle Sprites mit der Anweisung ``self.all_sprites_list.update()`` aktualisiert. Mit der Physik-Engine aktualisieren wir stattdessen die Sprites mithilfe des ``update`` der Physik-Engine:

source: The simple physics engine follows the following algorithm:
de: Die einfache Physik-Engine folgt dem folgenden Algorithmus:

source: Move the player in the x direction according to the player's ``change_x`` value.
de: Bewege die Spielfigur in x-Richtung entsprechend dem ``change_x``-Wert der Spielfigur.

source: Check the player against the wall list and see if there are any collisions.
de: Überprüfe mit der Wandliste, ob Kollisionen mit der Spielfigur vorliegen.

source: If the player is colliding:
de: Wenn die Spielfigur kollidiert:

source: If the player is moving right, set the player's right edge to the wall's left edge.
de: Wenn sich die Spielfigur nach rechts bewegt, setze die rechte Kante der Spielfigur auf die linke Kante der Wand.

source: If the player is moving left, set the player's left edge to the wall's right edge.
de: Wenn sich die Spielfigur nach links bewegt, setze die linke Kante der Spielfigur auf die rechte Kante der Wand.

source: If the player isn't moving left or right, print out a message that we are confused how we hit something when we aren't moving.
de: Wenn sich die Spielfigur nicht nach links oder rechts bewegt, gebe die Nachricht aus, dass wir verwirrt sind, wie wir auf etwas treffen können, wenn wir uns nicht bewegen.

source: Then we just do the same thing, except with the y coordinates.
de: Dann machen wir dasselbe, nur mit den y-Koordinaten.

source: You can see the `physics engine source code`_ on GitHub.
de: Du kannst dir den `Physics Engine Source Code`_ auf GitHub ansehen.

source: Here's the full example:
de: Hier ist das vollständige Beispiel:

source: Using a View Port for Scrolling
de: Verwenden eines Bildausschnitts zum Scrollen

source: What if one screen isn't enough to hold your maze of walls? We can have a world that is larger than just our window. We do this by adjusting the *view port*. Normally coordinate (0, 0) is the lower left corner of our screen. We can change that! We could have an entire world stretch from (0, 0) to (3000, 3000), and have a smaller view port that was 800x640 that scrolled around that.
de: Was ist, wenn ein Bildschirm nicht ausreicht, um Ihr Wandlabyrinth zu enthalten? Wir können eine Welt erstellen, die größer ist als nur unser Fenster. Wir tun dies, indem wir den *View Port* (Bildausschnitt) anpassen. Normalerweise ist die Koordinate (0, 0) die untere linke Ecke unseres Bildschirms. Das können wir ändern! Wir könnten eine ganze Welt von (0, 0) bis (3000, 3000) haben und einen kleineren Ausschnitt von 800 x 640, in dem wir herum scrollen.

source: The command for using the view port is ``set_viewport``. This command takes four arguments. The first two are the left and bottom boundaries of the window. By default these are zero. That is why (0, 0) is in the lower left of the screen. The next two commands are the top and right coordinates of the screen. By default these are the screen width and height, minus one. So an 800 pixel-wide window would have x-coordinates from 0 - 799.
de: Der Befehl zur Verwendung des Bildausschnitts lautet ``set_viewport``. Dieser Befehl benötigt vier Argumente. Die ersten beiden sind die linken und unteren Grenzen des Fensters. Standardmäßig sind diese Null. Aus diesem Grund befindet sich (0, 0) unten links auf dem Bildschirm. Die nächsten beiden Befehle sind die oberen und rechten Koordinaten des Bildschirms. Standardmäßig sind dies die Bildschirmbreite und -höhe minus eins. Ein 800 Pixel breites Fenster hätte also x-Koordinaten von 0 bis 799.

source: A command like this would shift the whole "view" of the window 200 pixels to the right:
de: Eine Anweisung wie die folgende verschiebt die gesamte "Ansicht" des Fensters um 200 Pixel nach rechts:

source: So with a 800 wide pixel window, we would show x-coordinates 200 - 999 instead of 0 - 799.
de: Bei einem 800 Pixel breiten Fenster würden wir also die x-Koordinaten 200 - 999 anstelle von 0 - 799 anzeigen.

source: Instead of hard-coding the shift at 200 pixels, we need to use a variable and have rules around when to shift the view. In our next example, we will create two new instance variables in our application class that hold the left and bottom coordinates for our view port. We'll default to zero.
de: Anstatt die Verschiebung um 200 Pixel fest zu codieren, müssen wir eine Variable verwenden und Regeln festlegen, wann die Ansicht verschoben werden soll. In unserem nächsten Beispiel erstellen wir zwei neue Objektvariablen in unserer Anwendungsklasse, die die linken und unteren Koordinaten für unseren Bildausschnitt enthalten. Wir werden sie standardmäßig auf Null setzen.

source: Next, in our update method, we need to see if the user has moved too close to the edge of the screen and we need to update the boundaries.
de: Als nächstes müssen wir in unserer ``update``-Methode sehen, ob der Benutzer zu nahe am Bildschirmrand ist, und wir müssen die Grenzen aktualisieren.

source: The full example is below:
de: Das vollständige Beispiel findest du unten:
