Repository: Cubik65536/arcade_book
Catalog: locale/*/LC_MESSAGES/chapters/23_libraries_and_modules/libraries_and_modules.po
Languages: de

source: Libraries and Modules
de: Bibliotheken und Module

source: A *library* is a collection of code for functions and classes. Often, these libraries are written by someone else and brought into the project so that the programmer does not have to "reinvent the wheel." In Python the term used to describe a library of code is module.
de: Eine *Bibliothek* ist eine Sammlung von Code für Funktionen und Klassen. Häufig werden diese Bibliotheken von einer anderen Person geschrieben und in das Projekt eingefügt, damit der Programmierer das Rad nicht neu erfinden muss. In Python nennt man die Bibliothek auch Modul.

source: By using ``import arcade`` and ``import random``, the programs created so far have already used modules. A library can be made up of multiple modules that can be imported. Often a library only has one module, so these words can sometimes be used interchangeably.
de: Durch die Verwendung von ``import arcade`` und ``import random`` haben die bisher erstellten Programme bereits Module verwendet. Eine Bibliothek kann aus mehreren Modulen bestehen, die importiert werden können. Häufig besteht eine Bibliothek nur aus einem Modul, sodass diese Wörter manchmal synonym verwendet werden können.

source: Modules are often organized into groups of similar functionality. In this class programs have already used functions from the ``math`` module, the ``random`` module, and the ``arcade`` library. Modules can be organized so that individual modules contain other modules. For example, the ``arcade`` module contains submodules for ``arcade.key``, and ``arcade.color``.
de: Module sind häufig in Gruppen mit ähnlicher Funktionalität organisiert. In diesem Kurs haben Programme bereits Funktionen aus dem ``math``-Modul, dem ``random``-Modul und der ``arcade``-Bibliothek verwendet. Module können so organisiert werden, dass einzelne Module andere Module enthalten. Zum Beispiel enthält das ``arcade``-Modul Submodule für ``arcade.key`` und ``arcade.color``.

source: Modules are not loaded unless the program asks them to. This saves time and computer memory. This chapter shows how to create a module, and how to import and use that module.
de: Module werden nur geladen, wenn das Programm sie dazu auffordert. Dies spart Zeit und Arbeitsspeicher. In diesem Kapitel erfährst du, wie man ein Modul erstellt und dieses Modul importiert und verwendt.

source: Why Create a Library?
de: Warum sollte man eine Bibliothek erstellen?

source: There are three major reasons for a programmer to create his or her own libraries:
de: Es gibt drei wichtige Gründe für einen Programmierer, seine eigenen Bibliotheken zu erstellen:

source: It breaks the code into smaller, easier to use parts.
de: Es zerlegt den Code in kleinere, einfacher zu verwendende Teile.

source: It allows multiple people to work on a program at the same time.
de: Dadurch können mehrere Personen gleichzeitig an einem Programm arbeiten.

source: The code written can be easily shared with other programmers.
de: Der geschriebene Code kann problemlos mit anderen Programmierern geteilt werden.

source: Some of the programs already created in this book have started to get rather long. By separating a large program into several smaller programs, it is easier to manage the code. For example, in the prior chapter's sprite example, a programmer could move the sprite class into a separate file. In a complex program, each sprite might be contained in its own file.
de: Einige der Programme, die bereits in diesem Buch erstellt wurden, sind schon ziemlich lang. Indem man ein großes Programm in mehrere kleinere Programme aufteilen, kann man den Programmcode einfacher verwalten. Beispielsweise könnte ein Programmierer im Sprite-Beispiel des vorherigen Kapitels die Sprite-Klasse in eine separate Datei verschieben. In einem komplexen Programm kann jedes Sprite in einer eigenen Datei enthalten sein.

source: If multiple programmers work on the same project, it is nearly impossible to do so if all the code is in one file. However, by breaking the program into multiple pieces, it becomes easier. One programmer could work on developing an "Orc" sprite class. Another programmer could work on the "Goblin" sprite class. Since the sprites are in separate files, the programmers do not run into conflict.
de: Wenn mehrere Programmierer an demselben Projekt arbeiten, ist dies nahezu unmöglich, wenn sich der gesamte Programmcode in einer Datei befindet. Durch Aufteilen des Programms in mehrere Teile wird es jedoch einfacher. Ein Programmierer könnte an der Entwicklung einer "Orc"-Sprite-Klasse arbeiten. Ein anderer Programmierer könnte an der Sprite-Klasse "Goblin" arbeiten. Da sich die Sprites in separaten Dateien befinden, treten bei den Programmierern keine Konflikte auf.

source: Modern programmers rarely build programs from scratch. Often programs are built from parts of other programs that share the same functionality. If one programmer creates code that can handle a mortgage application form, that code will ideally go into a library. Then any other program that needs to manage a mortgage application form at that bank can call on that library.
de: Moderne Programmierer erstellen Programme selten von Grund auf neu. Oft werden Programme aus Teilen anderer Programme erstellt, die die gleiche Funktionalität haben. Wenn ein Programmierer Code erstellt, der ein Hypothekenantragsformular verarbeiten kann, wird dieser Code idealerweise in eine Bibliothek verschoben. Dann kann jedes andere Programm, das ein Hypothekenantragsformular bei dieser Bank verwalten muss, diese Bibliothek aufrufen.

source: Creating Your Own Module/Library File
de: Erstellen Ihrer eigenen Modul- / Bibliotheksdatei

source: Video: Libraries
de: Video: Bibliotheken

source: In this example we will break apart a short program into multiple files. Here we have a function in a file named ``test.py``, and a call to that function:
de: In diesem Beispiel werden wir ein kurzes Programm in mehrere Dateien aufteilen. Hier haben wir eine Funktion in einer Datei namens ``test.py`` und einen Aufruf dieser Funktion:

source: test.py with everything in it
de: test.py mit allem drin

source: Yes, this program is not too long to be in one file. But if both the function and the main program code were long, it would be different. If we had several functions, each 100 lines long, it would be time consuming to manage that large of a file. But for this example we will keep the code short for clarity.
de: Ja, dieses Programm ist nicht zu lang, um in einer Datei zu sein. Wenn jedoch sowohl die Funktion als auch der Hauptprogrammcode lang wären, wäre dies anders. Wenn wir mehrere Funktionen mit jeweils 100 Zeilen Länge hätten, wäre es zeitaufwändig, diese große Datei zu verwalten. In diesem Beispiel wird der Code jedoch aus Gründen der Übersichtlichkeit kurz gehalten.

source: We can move the ``foo`` function out of this file. Then this file would be left with only the main program code. (In this example there is no reason to separate them, aside from learning how to do so.)
de: Wir können die Funktion ``foo`` aus dieser Datei heraus verschieben. Dann würde diese Datei nur den Hauptprogrammcode enthalten. (In diesem Beispiel gibt es keinen Grund, sie aus dem Hauptprogrammcode heraus zu holen, außer zu lernen, wie man das macht.)

source: To do this, create a new file and copy the ``foo`` function into it. Save the new file with the name ``my_functions.py``. The file must be saved to the same directory as ``test.py``.
de: Erstellen Sie dazu eine neue Datei und kopieren Sie die Funktion ``foo`` hinein. Speichern Sie die neue Datei unter dem Namen ``my_functions.py``. Die Datei muss im selben Verzeichnis wie ``test.py`` gespeichert werden.

source: test.py that doesn't work
de: test.py die nicht funktioniert

source: Unfortunately it isn't as simple as this. The file ``test.py`` does not know to go and look at the ``my_functions.py`` file and import it. We have to add the command to import it:
de: Leider ist es nicht so einfach. Die Datei ``test.py`` weiß nicht, dass sie die Funktion ``foo`` in der Datei ``my_functions.py`` findet und sie importieren muss. Wir müssen eine Anweisung hinzufügen, um das Modul zu importieren:

source: test.py that imports but still doesn't work
de: test.py die importiert, aber immer noch nicht funktioniert

source: That still doesn't work. What are we missing? Just like when we import arcade, we have to put the package name in front of the function. Like this:
de: Das geht immer noch nicht. Was fehlt uns? Genau wie beim Import von arcade müssen wir den Paketnamen vor die Funktion stellen. Wie folgt:

source: test.py that finally works
de: test.py die endlich funktioniert

source: This works because ``my_functions.`` is prepended to the function call.
de: Dies funktioniert, weil ``my_functions.`` vor dem Funktionsaufruf steht.

source: Namespace
de: Namensräume

source: Video: Namespace
de: Video: Namensraum

source: A program might have two library files that need to be used. What if the libraries had functions that were named the same? What if there were two functions named print_report, one that printed grades, and one that printed an account statement? For instance:
de: Ein Programm verfügt möglicherweise über zwei Bibliotheksdateien, die verwendet werden müssen. Was passiert, wenn die Bibliotheken Funktionen hätten, die den gleichen Namen haben? Was passiert, wenn es zwei Funktionen mit dem Namen ``print_report`` gibt, eine, die Noten ausgibt, und eine, die einen Kontoauszug ausgibt? Zum Beispiel:

source: How do you get a program to specify which function to call? Well, that is pretty easy. You specify the *namespace*. The namespace is the work that appears before the function name in the code below:
de: Wie kann ein Programm angeben, welche Funktion aufgerufen werden soll? Das ist ziemlich einfach. Sie geben den *Namensraum* an. Der Namensraum ist der Teil, der vor dem Funktionsnamen im folgenden Code angezeigt wird:

source: test.py that calls different print_report functions
de: test.py, das verschiedene ``print_report``-Funktionen aufruft

source: So now we can see why this might be needed. But what if you don't have name collisions? Typing in a namespace each and every time can be tiresome. You can get around this by importing the library into the *local namespace*. The local namespace is a list of functions, variables, and classes that you don't have to prepend with a namespace. Going back to the ``foo`` example, let's remove the original import and replace it with a new type of import:
de: Jetzt können wir verstehen, warum dies nötig sein könnte. Was aber, wenn es keine Namenskollisionen gibt? Das Eingeben eines Namensraums jedes Mal kann mühsam sein. Man kann dies umgehen, indem man die Bibliothek in den *lokalen Namensraum* importiert. Der lokale Namensraum ist eine Liste von Funktionen, Variablen und Klassen, denen kein Namensraum vorangestellt werden muss. Um zum Beispiel ``foo`` zurückzukehren, entfernen wir den ursprünglichen Import und ersetzen ihn durch einen neuen Importtyp:

source: This works even without ``my_functions.`` prepended to the function call. The asterisk is a wildcard that will import all functions from ``my_functions``. A programmer could import individual ones if desired by specifying the function name.
de: Dies funktioniert auch ohne das ``my_functions.``, das dem Funktionsaufruf vorangestellt werden. Das Sternchen ist ein Platzhalter, der alle Funktionen aus ``my_functions`` importiert. Ein Programmierer kann bei Bedarf einzelne importieren, indem er den Funktionsnamen angibt.

source: Third Party Libraries
de: Bibliotheken von Drittanbietern

source: When working with Python, it is possible to use many libraries that are built into Python. Take a look at all the libraries that are available here:
de: Bei der Arbeit mit Python können viele in Python integrierte Bibliotheken verwendet werden. Schaue dir alle hier verfügbaren Bibliotheken an:

source: It is possible to download and install other libraries. There are libraries that work with the web, complex numbers, databases, and more.
de: Es ist möglich, weitere Bibliotheken herunterzuladen und zu installieren. Es gibt Bibliotheken, die mit dem Internet arbeiten, komplexe Zahlen, Datenbanken und mehr.

source: Arcade: The library that this book uses to create games. http://arcade.academy
de: Arcade: Die Bibliothek, mit der dieses Buch Spiele erstellt. http://arcade.academy

source: Pygame: Another library used to create games, and the inspiration behind the creation of the Arcade library. http://www.pygame.org/docs/
de: Pygame: Eine weitere Bibliothek, die zum Erstellen von Spielen verwendet wurde, und die Inspiration für die Erstellung der Arcade-Bibliothek. http://www.pygame.org/docs/

source: Pymunk: A great library for running 2D physics. Also works with Arcade, see `these examples <http://arcade.academy/examples/index.html#pymunk>`_ http://www.pymunk.org/
de: Pymunk: Eine großartige Bibliothek zum Ausführen von 2D-Physik. Funktioniert auch mit Arcade, siehe `diese Beispiele <http://arcade.academy/examples/index.html#pymunk>`_ http://www.pymunk.org/

source: wxPython: Create GUI programs, with windows, menus, and more. http://www.wxpython.org/
de: wxPython: Erstellt GUI-Programme mit Fenstern, Menüs und mehr. http://www.wxpython.org/

source: pydot: Generate complex directed and non-directed graphs http://code.google.com/p/pydot/
de: pydot: Generiert komplexe gerichtete und ungerichtete Graphen. https://github.com/pydot/pydot

source: Pandas: A library for data analysis. https://pandas.pydata.org/
de: Pandas: Eine Bibliothek zur Datenanalyse. https://pandas.pydata.org/

source: Pillow: Work with images. https://pillow.readthedocs.io/en/latest/
de: Pillow: Bearbeiten von Bildern. https://pillow.readthedocs.io/en/latest/

source: You can do analysis and create your own interactive notebook using Jupyter:
de: Mit Jupyter kann man Analysen durchführen und sein eigenes interaktives Notizbuch erstellen:

source: Some libraries we give examples of in this chapter:
de: Einige Bibliotheken, für die wir in diesem Kapitel Beispiele angeben:

source: OpenPyXL: A library for reading and writing Excel files. https://openpyxl.readthedocs.io/en/stable/
de: OpenPyXL: Eine Bibliothek zum Lesen und Schreiben von Excel-Dateien. https://openpyxl.readthedocs.io/en/stable/

source: Beautiful Soup: Grab data off websites, and create your own web bots. https://www.crummy.com/software/BeautifulSoup/
de: Beautiful Soup: Holt Daten von Websites und erstellt eigene Web-Bots. https://www.crummy.com/software/BeautifulSoup/

source: MatPlotLib: Plot data automatically: https://matplotlib.org/
de: MatPlotLib: Daten automatisch zeichnen: https://matplotlib.org/

source: A wonderful list of Python libraries and links to installers for them is available here:
de: Eine wunderbare Liste von Python-Bibliotheken und Links zu Installationsprogrammen für sie finden Sie hier:

source: You can search up some top packages/libraries and stand alone projects to get an idea of what you can do. There are many articles like `Top 15 Python Libraries for Data Science in 2017 <https://medium.com/activewizards-machine-learning-company/top-15-python-libraries-for-data-science-in-in-2017-ab61b4f9b4a7>`_.
de: Du kannst dir einige Top-Pakete/Bibliotheken und eigenständige Projekte anschauen, um eine Vorstellung davon zu bekommen, was du erreichen kannst. Es gibt viele Artikel wie `Top 15 Python Libraries for Data Science in 2017 <https://medium.com/activewizards-machine-learning-company/top-15-python-libraries-for-data-science-in-in- 2017-ab61b4f9b4a7>`_.

source: Examples: OpenPyXL Library
de: Beispiele: OpenPyXL Library

source: This example uses a library called OpenPyXL to write an Excel file. It is also easy to read from an Excel file. You can install OpenPyXL from the Windows command prompt by typing ``pip install openpyxl``. If you are on the Mac or a Linux machine, you can type ``sudo pip3 install openpyxl``.
de: In diesem Beispiel wird eine Bibliothek mit dem Namen OpenPyXL zum Schreiben einer Excel-Datei verwendet. Es ist auch einfach, aus einer Excel-Datei zu lesen. Du kannst OpenPyXL über die Windows-Eingabeaufforderung installieren, indem du ``pip install openpyxl`` eingibst. Wenn du auf einem Mac oder Linux-Computer arbeitest, kannst du ``sudo pip3 install openpyxl`` eingeben.

source: When starting the command prompt, you might need to right-click on it and select "Run as administrator" if you get permission errors when installing. And if you are working on a lab computer, you might not have permission to install libraries.
de: Beim Starten der Eingabeaufforderung musst du möglicherweise mit der rechten Maustaste darauf klicken und "Als Administrator ausführen" auswählen, wenn bei der Installation Berechtigungsfehler auftreten. Und wenn du an einem Schulrechner arbeitest, bist du möglicherweise nicht berechtigt, Bibliotheken zu installieren.

source: The output of this program is an Excel file:
de: Die Ausgabe dieses Programms ist eine Excel-Datei:

source: Examples: Beautiful Soup Library
de: Beispiele: Beautiful Soup Bibliothek

source: This example grabs information off a web page. You can install Beautiful Soup from the Windows command prompt by typing ``pip install bs4``. If you are on the Mac or a Linux machine, you can type ``sudo pip3 install bs4``.
de: In diesem Beispiel werden Informationen von einer Webseite abgerufen. Du kannst Beautiful Soup über die Windows-Eingabeaufforderung installieren, indem du ``pip install bs4`` eingeben. Wenn du auf einem Mac- oder Linux-Computer arbeitest, kannst du ``sudo pip3 install bs4`` eingeben.

source: Examples: Matplotlib Library
de: Beispiele: Matplotlib

source: Here is an example of what you can do with the third party library "Matplotlib." You can install Matplotlib from the Windows command prompt by typing ``pip install matplotlib``. If you are on the Mac or a Linux machine, you can type ``pip3 install matplotlib``.
de: Hier ist ein Beispiel dafür, was man mit der Drittanbieter-Bibliothek "Matplotlib" machen kann. Du kannst Matplotlib über die Windows-Eingabeaufforderung installieren, indem du ``pip install matplotlib`` eingibst. Wenn du auf einem Mac- oder Linux-Computer arbeitest, kannst du ``pip3 install matplotlib`` eingeben.

source: Example 1: Simple Plot
de: Beispiel 1: Einfaches Diagramm

source: To start with, here is the code to create a simple line chart with four values:
de: Zunächst ist hier der Code zum Erstellen eines einfachen Liniendiagramms mit vier Werten:

source: Simple Line Graph
de: Einfaches Liniendiagramm

source: Example 1
de: Beispiel 1

source: Note that you can zoom in, pan, and save the graph. You can even save the graph in vector formats like ps and svg that import into documents without loss of quality like raster graphics would have.
de: Beachte, dass man das Diagramm vergrößern, schwenken und speichern kann. Man kann das Diagramm sogar in Vektorformaten wie ps und svg speichern, die ohne Qualitätsverlust in Dokumente importiert werden, wie dies bei Raster-Grafiken der Fall wäre.

source: Example 2: Specify x Values
de: Beispiel 2: Geben Sie x-Werte an

source: The x value for Example 1, defaults to start at zero. You can change this default and specify your own x values to go with the y values. See Example 2 below.
de: Der x-Wert für Beispiel 1 beginnt standardmäßig bei Null. Man kann diese Standardeinstellung ändern und die eigenen x-Werte angeben, die zu den y-Werten passen. Siehe das Beispiel 2 unten:

source: Specifying the x values
de: Angabe der x-Werte

source: Example 2
de: Beispiel 2

source: Example 3: Add A Second Data Series
de: Beispiel 3: Hinzufügen einer zweiten Datenreihe

source: It is trivial to add another data series to the graph.
de: Es ist trivial, dem Diagramm eine weitere Datenreihe hinzuzufügen.

source: Graphing two data series
de: Zwei Datenreihen graphisch darstellen

source: Example 3
de: Beispiel 3

source: Example 4: Add A Legend
de: Beispiel 4: Legende hinzufügen

source: You can add a legend to the graph:
de: Man kann dem Diagramm eine Legende hinzufügen:

source: Adding a legend
de: Legende hinzufügen

source: Example 4
de: Beispiel 4

source: Example 5: Add Annotations
de: Beispiel 5: Hinzufügen von Anmerkungen

source: You can add annotations to a graph:
de: Man kann einem Diagramm Anmerkungen hinzufügen:

source: Adding annotations
de: Anmerkungen hinzufügen

source: Example 5
de: Beispiel 5

source: Example 6: Change Line Styles
de: Beispiel 6: Ändern von Linienstilen

source: Don't like the default lines styles for the graph? That can be changed by adding a third parameter to the plot command.
de: Mag man die Standard-Linienstile für das Diagramm nicht? Dies kann durch Hinzufügen eines dritten Parameters zum Zeichenbefehl geändert werden.

source: Specifying the line style
de: Festlegen des Linienstils

source: Example 6
de: Beispiel 6

source: Example 7: Bar Chart
de: Beispiel 7: Balkendiagramm

source: A bar chart is as easy as changing plot to bar.
de: Ein Balkendiagramm bekommt man einfach durch Ändern von ``plot`` in ``bar``.

source: Bar chart
de: Balkendiagramm

source: Example 7
de: Beispiel 7

source: Example 8: Axis Labels
de: Beispiel 8: Achsenbeschriftungen

source: You can add labels to axis values.
de: Man kann an die Achsen Beschriftungen hinzufügen.

source: X-axis labels
de: X-Achsenbeschriftungen

source: Example 8
de: Beispiel 8

source: Example 9: Graph Functions
de: Beispiel 9: Diagrammfunktionen

source: You can graph functions as well. This uses a different package called numpy to graph a sine function.
de: Man kann auch Funktionen graphisch darstellen. Hierbei wird ein anderes Paket namens numpy verwendet, um eine Sinusfunktion graphisch darzustellen.

source: Graphing a sine function
de: Eine Sinusfunktion grafisch darstellen

source: Example 9
de: Beispiel 9

source: Example 10: Graph Functions With Fill
de: Beispiel 10: Diagrammfunktionen mit Füllung

source: You can fill in a graph if you like.
de: Man kann ein Diagramm ausfüllen, wenn man möchte.

source: Filling in a graph
de: Ein Diagramm ausfüllen

source: Example 10
de: Beispiel 10

source: Example 11: Pie Chart
de: Beispiel 11: Tortendiagramm

source: Create a pie chart.
de: Erstellen eines Tortendiagramms.

source: Pie chart
de: Tortendiagramm

source: Example 11
de: Beispiel 11

source: Example 12: Candlestick Chart
de: Beispiel 12: Candlestick-Chart

source: You can do really fancy things, like pull stock data from the web and create a candlestick graph for Apple Computer:
de: Man kann wirklich ausgefallene Dinge tun, zum Beispiel Bestandsdaten aus dem Web abrufen und ein Candlestick-Diagramm des Börsenkurse von Apple Computer erstellen:

source: Example 12
de: Beispiel 12

source: There are many more things that can be done with matplotlib. Take a look at the thumbnail gallery:
de: Es gibt noch viele andere Dinge, die mit matplotlib erledigt werden können. Schau dir die Thumbnail-Galerie an:
