Repository: Cubik65536/arcade_book
Catalog: locale/*/LC_MESSAGES/labs/lab_04_camel/camel.po
Languages: de

source: Lab 4: Camel
de: Übung 4: Kamel

source: Description of the Camel Game
de: Beschreibung des Kamelspiels

source: The idea for Camel originally came from the Heath Users Group and was published in `More BASIC Computer Games`_ in 1979.
de: Die Idee zu Kamel kommt ursprünglich aus der Heath Users Group und wurde 1979 in `More BASIC Computer Games`_ veröffentlicht.

source: The idea is to ride your camel across the desert while being chased. You need to manage your thirst, how tired the camel is, and how far ahead of the natives you are.
de: Die Idee ist, auf einem Kamel durch die Wüste zu reiten, während man gejagt wird. Du musst deinen Durst, wie müde dein Kamel ist und wie weit du vor den Einheimischen bist beachten.

source: This is one of the first games I programmed on the Apple //e. The game is flexible. I've had students create Star Wars themed versions of this game where you need to ride a wampa across Hoth. It is easy to add sandstorms and other random events to the game to make it more interesting. Even though it is only a text-based game, I've found some students really get into playing it. Once I had a professor come and complain when my students were too loud while playing this game on the "big screen."
de: Dies ist eins der ersten Programme, die ich auf dem Apple //e programmiert habe. Das Spiel ist flexibel. Ich hatte Studierende, die eine Star Wars Version von diesem Spiel programmiert haben, in dem man auf einem Wampa über Hoth reitest. Es ist leicht ein paar Sandstürme und andere zufällige Ereignisse hinzu zu fügen, um es interessanter zu machen. Obwohl es nur ein textbasiertes Spiel ist, habe ich einige Studierende gefunden, die richtig Spaß haben es zu spielen. Es gab sogar einmal einen Professor, der kam und sich beschwert hat, dass meine Studierenden zu laut wären, während sie dieses Spiel auf dem "großen Schirm" spielten.

source: Sample Run of Camel
de: Beispiellauf vom Kamel

source: Here is a sample run of the game:
de: Hier ist ein Beispielablauf des Spiels:

source: Programming Guide
de: Programmieranleitung

source: Here are the steps to complete this lab. Feel free to modify and add to the lab. Try the game with friends and family.
de: Hier sind die Schritte, um diese Übung abzuschließen. Modifiziere und erweitere ruhig die Übung. Probier dieses Spiel mit Freunden und deiner Familie aus.

source: Create a new directory in your project for ``Lab 04 - Camel`` and a file called ``lab_04.py`` in that folder if the folder and file don't exist already.
de: Erstelle ein neues Verzeichnis in deinem Projekt für ``Lab 04 - Camel`` und eine Datei ``lab_04.py`` in diesem Ordner, wenn der Ordner und die Datei noch nicht existieren.

source: In that file create a new ``main()`` function. Have it print the instructions to the screen. Do this with multiple ``print`` statements. Don't use one ``print`` statement and multiple ``\n`` characters to jam everything on one line.
de: Erstelle in dieser Datei eine neue ``main()``-Funktion. Lass es die Anleitung auf dem Bildschirm ausgeben. Implementiere dies mit mehreren ``print``-Anweisungen. Verwende nicht nur eine ``print``-Anweisung und mehrere ``\n``-Zeichen, um alles in eine Zeile zu quetschen.

source: Call the ``main()`` function. Run and test the program.
de: Rufe die ``main()``-Funktion auf. Starte und teste das Programm.

source: Continue from the prior step and create a Boolean variable called ``done`` and set to ``False``. Make sure this, and everything else, is in the ``main`` function.
de: Fahre beim vorigen Schritt fort und erstelle eine Boolesche Variable die ``done`` heißt und den Wert ``False`` hat. Stelle sicher, dass dies und der ganze Rest in der ``main()``-Funktion ist.

source: Create a ``while`` loop that will keep looping while ``done`` is ``False``.
de: Erstelle eine ``while``-Schleife, die so lange ``done`` ``False`` ist wiederholt.

source: Inside the loop, print out the following:
de: Innerhalb der Schleife, gib das folgende aus:

source: Ask the user for their choice. Make sure to add a space before the quote so the user input doesn't run into your text. That is, it should look like:
de: Frage die Anwenderin nach ihrer Auswahl. Stelle sicher ein Leerzeichen vor dem Anführungszeichen einzufügen, so dass die Eingabe der Anwenderin nicht direkt auf deinen Text folgt. Das heißt, es soll so aussehen:

source: And not:
de: Und nicht:

source: If the user's choice is ``Q``, then set ``done`` to ``True``. By doing something like ``user_choice.upper()`` instead of just ``user_choice`` in your ``if`` statement you can make it case-insensitive. Also, print something to the user to let her know she quit the game. Users need feedback.
de: Wenn die Anwenderin ``Q`` wählt, dann setze ``done`` auf ``True``. Du kannst die Eingabe durch ``user_choice.upper()`` anstatt von nur ``user_choice`` in der ``if``-Anweisung in Großbuchstaben umwandeln. Gib ebenfalls etwas aus, um die Anwenderin wissen zu lassen, dass sie das Spiel beendet hat. Anwender brauchen Feedback.

source: Test and make sure that you can quit out of the game, and that it works for both upper and lower case.
de: Teste und stelle sicher, dass du das Spiel beenden kannst, und dass es sowohl mit Groß- als auch mit Kleinbuchstaben funktioniert.

source: Before your main program loop, create variables for miles traveled, thirst, camel tiredness. Set these to zero. Creating accurate, descriptive variable names will make the rest of this lab less confusing.
de: Erstelle Variablen für zurückgelegte Kilometer, Durst und Kamelmüdigkeit vor deiner Hauptprogrammschleife. Setz diese auf Null. Die Verwendung präzise, beschreibende Variablennamen wird den Rest der Übung weniger verwirrend machen.

source: Create a variable for the distance the natives have traveled and set it to -20. (Twenty miles back.) Understanding how we track the player's distance, the native's distance, and the difference between the two tends to confuse some people. See the videos at the end of this lab for some hints.
de: Erstelle eine Variable für die Distanz, die die Einheimischen zurückgelegt haben und setze sie auf -20. (Zwanzig Kilometer zurück.) Zu verstehen, wie wir die zurückgelegte Distanz der Spielerin, die zurückgelegte Distanz der Einheimischen und die Differenz der beiden verwalten neigt dazu, einige Leute zu verwirren. Siehe die Videos am Ende dieser Übung für ein paar Hinweise.

source: Create and set an initial number of drinks in the canteen. I use three.
de: Erstelle und initialisiere eine Anzahl Schlucke in der Feldflasche. Ich verwende drei.

source: Go back to inside your main program loop. Add an ``elif`` to the ``if`` that is checking for the quit command. See if the user is asking for status. If so, print out the miles traveled, the drinks in the canteen, and how far the natives are behind you. If you aren't sure how to calculate that, see the videos at the end of this lab. (Seriously. This is a section where a lot of people start down the wrong path.)
de: Gehe zurück in die Hauptprogrammschleife. Füge ein ``elif`` and das Ende des ``if``, das auf das Quit-Kommando. Sehe nach, ob die Anwenderin nach dem Status fragt. Wenn das der Fall ist, gib die zurückgelegten Kilometer aus, die Anzahl der Schlucke in der Feldflasche und wie weit die Einheimischen hinter dir sind. Wenn du nicht sicher bist, wie das berechnet wird, sieh dir die Videos am Ende dieser Übung an. (Im Ernst, das ist die Stelle, an der eine Menge beginnen den falschen Weg einzuschlagen.)

source: Add an ``elif`` in your main program loop and handle if the user wants to stop for the night. If the user does, reset the camel's tiredness to zero. Print that the camel is happy, and move the natives up a random amount from 7 to 14 or so. Note: calculate random numbers IN the loop, just before you need them. A common mistake is to calculate the random numbers you need BEFORE the main loop. Causing your random numbers to stay the same the entire game.
de: Füge ein ``elif`` zu deiner Hauptprogrammschleife hinzu, um zu bearbeiten, wenn die Anwenderin für die Nacht stoppen will. Wenn die Anwenderin das will, setze die Ermüdung des Kamels auf 0 zurück. Gib aus, dass das Kamel zufrieden ist und bewege die Einheimischen eine zufällige Anzahl von 7 bis 14 (oder so) Kilometern vorwärts. Hinweis: Berechne die zufällige Anzahl *in* der Schleife, kurz bevor du sie benötigst. Ein üblicher Fehler ist die Zufallszahlen, die du benötigst, *vor* der Hauptschleife zu berechnen. Dadurch bleiben die Zufallszahlen gleich während des gesamten Spiels.

source: Add an ``elif`` in your main program loop and handle if the user wants to go ahead full speed. If the user does, go forward a random amount between 10 and 20 inclusive. Print how many miles the user traveled. Add 1 to thirst. Add a random 1 to 3 to camel tiredness. Move the natives up 7 to 14 miles.
de: Füge ein ``elif`` zu deiner Hauptprogrammschleife hinzu, um zu bearbeiten, ob die Anwenderin mit voller Geschwindigkeit reiten will. Wenn die Anwenderin das will, gehe eine zufällige Anzahl von Kilometern zwischen 10 und 20 inklusive vorwärts. Gib aus, wie viele Kilometer die Anwenderin vorwärts gekommen ist. Addiere 1 zum Durst hinzu. Addiere einen zufälligen Wert von 1 bis 3 zur Ermüdung des Kamels hinzu. Beweg die Einheimischen von 7 bis 14 Kilometer vorwärts.

source: Add an ``elif`` in your main program loop and handle if the user wants to go ahead moderate speed. If the user does, go forward a random amount between 5 and 12 inclusive. Print how many miles the user traveled. Add 1 to thirst. Add 1 to camel tiredness. Move the natives up 7 to 14 miles.
de: Füge ein ``elif`` zu deiner Hauptprogrammschleife hinzu, um zu bearbeiten, ob die Anwenderin mit moderater Geschwindigkeit reiten will. Wenn die Anwenderin das will, gehe eine zufällige Anzahl von Kilometern zwischen 5 und 12 inklusive vorwärts. Gib aus, wie viele Kilometer die Anwenderin vorwärts gekommen ist. Addiere 1 zum Durst hinzu. Addiere 1 zur Ermüdung des Kamels hinzu. Beweg die Einheimischen von 7 bis 14 Kilometer vorwärts.

source: Add an ``elif`` in your main program loop and handle if the user wants to go ahead drink from the canteen. If the user does, make sure there are drinks in the canteen. If there are, subtract one drink and set the player's thirst to zero. Otherwise print an error.
de: Füge ein ``elif`` zu deiner Hauptprogrammschleife hinzu, um zu bearbeiten, ob die Anwenderin aus der Feldflasche trinken möchte. Wenn die Anwenderin das will, stelle sicher, dass noch Schlucke in der Feldflasche sind. Wenn welche da sind, ziehe einen Schluck ab und setze den Durst auf Null. Andernfalls gib einen Fehler aus.

source: In the loop, print "You are thirsty." if the user's thirst is above 4. Put this after your long ``if`` ... ``elif`` chain above.
de: In der Schleife gib "Du bist durstig." aus, wenn der Durst der Anwenderin über 4 ist. Schreibe dies hinter deine lange Kette von ``if`` ... ``elif`` oben.

source: Print "You died of thirst!" if the user's thirst is above 6. Set ``done`` to ``True``. Make sure you create your code so that the program doesn't print both "Your are thirsty" and "You died of thirst!" Use ``elif`` as appropriate.
de: Gib "Du bist verdurstet!", wenn der Durst der Anwenderin über 6 ist. Setze ``done`` auf ``True``. Stelle sicher, dass dein Code nicht sowohl "Du bist durstig." als auch "Du bist verdurstet!" ausgibt. Verwende ``elif`` wie es passt.

source: Print "Your camel is getting tired." if the camel's tiredness is above 5.
de: Gib "Dein Kamel wird müde." aus, wenn die Müdigkeit des Kamels über 5 ist.

source: Print "Your camel is dead." if the camel's tiredness is above 8. Like the prior steps, print one or the other. It is a good idea to include a check with the done variable so t hat you don't print that your camel is getting tired after you died of thirst.
de: Gib "Dein Kamel ist tot." aus, wenn die Müdigkeit des Kamels über 8 ist. Wie im vorigen Schritt, gib entweder das eine oder das andere aus. Es ist eine gute Idee eine Überprüfung mit der ``done`` Variablen einzufügen, so dass ihr Kamel nicht ermüdet, nachdem du verdurstet bist.

source: If the natives have caught up, print that they caught the player and end the game.
de: Wenn die Einheimischen die Anwenderin eingeholt haben, gib aus, dass sie den Spieler gefangen haben.

source: Else if the natives are less than 15 miles behind, print "The natives are getting close!"
de: Andernfalls, wenn die Einheimischen weniger als 15 Kilometer zurück liegen, gib "Die Einheimischen kommen nah!" aus.

source: If the user has traveled 200 miles across the desert, print that they won and end the game. Make sure they aren't dead before declaring them a winner. If they land on mile marker 201 instead of 200, make sure they still win the game. See the videos below.
de: Wenn die Anwenderin 200 Kilometer durch die Wüste geritten ist, gib aus, dass sie gewonnen hat und beende das Spiel. Stelle sicher, dass Reiter und Kamel nicht tot sind, bevor du sie zum Sieger erklärst. Wenn sie auf dem Kilometerstein 201 statt 200 landet, stelle sicher, dass sie trotzdem das Spiel gewinnt. Siehe die Videos unten an.

source: Add a one-in-twenty chance of finding an oasis. Print that the user found it, refill the canteen, reset player thirst, and rest the camel. If you aren't sure how to do this, see :ref:`random_chance`. Make sure a person can't find the oasis unless they are traveling. This will require you to think about where you are putting this code.
de: Füge eine Eins-zu-Zwanzig-Chance eine Oase zu finden hinzu. Gib, dass die Anwenderin sie gefunden hat, aus, fülle die Feldflasche auf und ruhe das Kamel aus. Wenn du nicht weißt, wie das gemacht wird, siehe :ref:`random_chance`. Stelle sicher, dass eine Person nur eine Oase finden kann, wenn sie reist. Dies erfordert, dass du darüber nachdenkst, wo du den Code hinschreibst.

source: Play the game and tune the numbers so it is challenging but not impossible. Fix any bugs you find.
de: Spiele das Spiel und passe die Zahlen so an, dass es herausfordernd, aber nicht unmöglich zu gewinnen ist. Beseitige alle Fehler, die du findest.

source: Hints
de: Hinweise

source: Remember that it is good idea to put blank lines between logical groupings of code in your program. For example, but a blank line after the instructions, and between each user command. Add comments where appropriate.
de: Denke daran, dass es eine gute Idee ist, Leerzeilen zwischen logischen Codegruppen in deinem Programm einzufügen. Füge zum Beispiel eine Leerzeile nach den Anweisungen und zwischen jedem Anwenderkommando ein. Füge Kommentare hinzu, wo es passt.

source: It is considered better style to use ``while not done:`` instead of ``while done == False:``
de: Es gilt als besserer Stil ``while not done:`` anstatt von ``while done == False:`` zu verwenden.

source: Rather than setting ``done`` to ``True``, you can immediately exit the main program loop by using the ``break`` statement. Some people prefer this method because it simplifies the logic. Other people prefer not jumping out of the middle of a loop. Quite frankly, either works.
de: Statt ``done`` auf ``True`` zu setzen, kannst du auch die Hauptprogrammschleife mit der ``break``-Anweisung verlassen. Einige Programmierer bevorzugen diese Methode, weil es die Programmlogik vereinfacht. Andere Programmierer vermeiden, aus einer Schleife heraus zu springen. Ehrlich gesagt, beides funktioniert.

source: To prevent bad message combinations, such as printing "You died of thirst." and "You found an oasis!" on the same turn, use the ``and`` operator. Such as, ``if not done and thirst > 4:``
de: Verwende den ``and``-Operator, um schlechte Nachrichtenkombinationen, wie "Du bist verdurstet." und "Du hast eine Oase erreicht!" in der gleichen Spielrunde, zu verhindern. Wie beispielsweise ``if not done and thirst > 4:``.

source: Make sure you add blank lines to divide up sections of code. Don't double space the code. Add comments ahead of code sections.
de: Stelle sicher, Leerzeilen zum Aufteilen von Codeabschnitten einzufügen. Verwende keine doppelten Leerzeichen im Code. Füge Kommentare vor den Codeabschnitten hinzu.

source: Watch the English and punctuation. Don't say ``you found an Oasis!``, say ``You found an oasis!``
de: Beachte die Rechtschreibung und Interpunktion. Sage nicht "du hast eine oase erreicht!", sage, "Du hast eine Oase erreicht!".

source: Occasionally people get confused about how to set a value back to zero. Study the code below:
de: Gelegentlich bringen Leute durcheinander, wie ein Wert auf Null zurückgesetzt wird. Untersuche den Code unten:

source: Calculating How Far Back the Natives Are
de: Berechnung wie weit die Einheimischen zurück sind

source: Figuring Out The End of the Game
de: Das Ende des Spiels feststellen
