Repository: Cubik65536/arcade_book
Catalog: locale/*/LC_MESSAGES/chapters/26_platformers/platformers.po
Languages: de

source: Platformers
de: Jump 'n' Run - Plattformspiele

source: Ever wanted to create your own platformer? It isn't too hard! Here's an example to get started.
de: Wolltest du schon immer deinen eigenen Plattformer erstellen? Es ist nicht zu schwer! Hier ist ein Beispiel für den Einstieg.

source: Map File
de: Map-Datei

source: Creating The Map
de: Erstellen der Map

source: First, we need a map. This is a "map" file created with the Tiled_ program. The program is free. You can download it and use it to create your map file.
de: Zuerst brauchen wir eine Map. Dies ist eine "Map"-Datei, die mit dem Programm Tiled_ erstellt wurde. Das Programm ist kostenlos. Du kannst es herunterladen und zum Erstellen deiner Map-Datei verwenden.

source: In this map file the numbers represent:
de: In dieser Map-Datei repräsentieren die Zahlen:

source: Number
de: Nummer

source: Item
de: Gegenstand

source: Empty square
de: Leeres Quadrat

source: Crate
de: Kiste

source: Left grass corner
de: Linke Grasecke

source: Middle grass corner
de: Mittlere Grasecke

source: Right grass corner
de: Rechte Grasecke

source: You can download these tiles (originally from kenney.nl) here:
de: Du kannst diese Kacheln (ursprünglich von kenney.nl) hier herunterladen:

source: Of course, you'll need a character to jump around the map:
de: Natürlich benötigen wir eine Spielfigur, die sich auf der Map herumbewegt:

source: Here is the map file:
de: Hier ist die Map-Datei:

source: The Tiled_ program takes some getting used to. You start off with a screen like this, and you can create a new map here:
de: Das Programm Tiled_ ist etwas gewöhnungsbedürftig. Sie beginnen mit einem Bildschirm wie diesem und können hier eine neue Map erstellen:

source: Then set up your map like this, adjusting the size of the map and the size of your images accordingly. (All your images need to be the same size. Don't guess this number, look at the properties of the image and find how big it is.)
de: Richte dann deine Karte wie folgt ein und passe die Größe der Karte und die Größe deiner Bilder entsprechend an. (Alle deine Bilder müssen dieselbe Größe haben. Rate diese Zahl nicht, sehe dir die Eigenschaften des Bildes an und finde heraus, wie groß es ist.)

source: Most of the tiles from kenney.nl are 128x128 pixels. In the image above I've got a 7 tile high, by 50 pixel wide side-scroll map.
de: Die meisten Kacheln von kenney.nl sind 128x128 Pixel groß. Im obigen Bild habe ich eine 7 Kacheln hohe, 50 Pixel breite Side-Scroll-Karte verwendet.

source: After this, you have to create a new "tile set." Find the button for that:
de: Danach musst du ein neues "tile set" erstellen. Finde den Button dafür:

source: I use these settings:
de: Ich benutze diese Einstellungen:

source: You can add the images as tiles to your tileset. I don't find this obvious, but you click the wrench icon, then the plus icon:
de: Du kannst die Bilder als Kacheln zu deinem Tileset hinzufügen. Ich finde das nicht offensichtlich, aber du klickst auf das Schraubenschlüsselsymbol und dann auf das Pluszeichen:

source: These "tiles" will be all the images for your map, and the numbers they associate with:
de: Diese "Kacheln" sind alle Bilder für deine Map und die Nummern, mit denen sie verknüpft sind:

source: The numbers of the tiles correspond to the order you added the tiles. I don't think you can change the mapping after you create the tileset.
de: Die Nummern der Kacheln entsprechen der Reihenfolge, in der Sie die Kacheln hinzugefügt haben. Ich glaube nicht, dass Sie die Zuordnung ändern können, nachdem Sie das Tileset erstellt haben.

source: Next, you "paint" your map:
de: Als nächstes "male" deine Karte:

source: When you are done, you can "Export as" a CSV file.
de: Wenn du fertig bist, kannst du eine CSV-Datei exportieren.

source: Reading The Map
de: Die Map lesen

source: Next, we want to read in this grid of numbers where each number is separated by a comma. We know how to read in a file, but how do you process a comma delimited file?
de: Als nächstes wollen wir dieses Zahlenraster einlesen, in dem jede Zahl durch ein Komma getrennt ist. Wir wissen, wie man eine Datei einliest, aber wie verarbeitet man eine CSV-Datei?

source: We've learned how to take a string and use the functions:
de: Wir haben gelernt, wie man einen String nimmt und die Funktionen verwendet:

source: There's another function called ``split()``. This function will split apart a string into a list based on a delimiter. For example:
de: Es gibt eine weitere Funktion namens ``split()``. Diese Funktion teilt eine Zeichenfolge auf der Grundlage eines Trennzeichens in eine Liste auf. Zum Beispiel:

source: This prints:
de: Dies gibt aus:

source: Which is close to what we want, except the list is a list of text, not numbers.
de: Das ist schon fast, was wir wollen, außer dass die Liste ist aus Text und nicht Zahlen besteht.

source: We can convert the list by:
de: Wir können die Liste folgendermaßen konvertieren:

source: We haven't covered it a lot, but you can also use ``enumerate`` to do the same thing:
de: Wir haben nicht viel darüber gesprochen, aber man kann auch ``enumerate`` verwenden, um dasselbe zu erreichen:

source: Or use a list comprehension:
de: Oder man verwendet Listen-Abstraktion:

source: Python does have built-in code for working with csv files. If you want, you can read about the `csv library` in the official documentation.
de: Python verfügt über integrierten Code für die Arbeit mit CSV-Dateien. Wenn du möchtest, kannst du dich in der offiziellen Dokumentation über die `csv library` informieren.

source: Platformer Physics Engine
de: Plattformer-Physik-Engine

source: In prior chapters, we've used the ``PhysicsEngineSimple`` to keep from running through walls. There's another engine called ``PhysicsEnginePlatformer`` for platformers.
de: In früheren Kapiteln haben wir das ``PhysicsEngineSimple`` verwendet, um zu verhindern, dass die Spielfigur durch Wände gehen kann. Es gibt eine weitere Engine namens ``PhysicsEnginePlatformer`` für Plattformer.

source: This engine has two important additions:
de: Diese Engine hat zwei wichtige Ergänzungen:

source: Gravity
de: Schwerkraft

source: ``can_jump`` method
de: ``can_jump``-Methode

source: Creating the platformer physics engine requires a gravity constant. I recommend 0.5 to start with. This is your acceleration in pixels per frame.
de: Das Erstellen der Plattformer-Physik-Engine erfordert eine Schwerkraftkonstante. Ich empfehle zu Beginn 0,5. Dies ist Ihre Beschleunigung in Pixel pro Frame.

source: Jumping
de: Springen

source: Also, you often need to know if there is ground beneath your character to know if she can jump. The physics engine has a method for this:
de: Außerdem musst du oft wissen, ob sich unter deiner Figur Boden befindet, um zu wissen, ob sie springen kann. Die Physik-Engine hat dafür eine Methode:

source: Python Program
de: Python-Programm

source: In the highlighted code for the listing below, see how we've implemented these concepts to create a platformer
de: Sieh dir im hervorgehobenen Code unten an, wie wir diese Konzepte implementiert haben, um einen Plattformer zu erstellen.

source: Platformer example, simple
de: Plattformer-Beispiel - einfach

source: Other Examples
de: Andere Beispiele

source: If you are looking for platforms that move, see `Sprite Moving Platforms`_.
de: Wenn du nach Plattformen suchst, die sich bewegen, lies `Sprite Moving Platforms`_.

source: If you are looking to be able to create ramps you can run up and down, see `Sprite Ramps`_.
de: Wenn du in der Lage sein möchtest, Rampen zu erstellen, die du rauf und runter laufen kannst, lies `Sprite Ramps`_.
