Repository: Cubik65536/arcade_book
Catalog: locale/*/LC_MESSAGES/chapters/06_what_*_a_programming_language/index.po
Languages: de

source: In this chapter we learned about what a CPU is, and that computer instructions are simply numbers fed into the CPU. We learned about first, second, and third generation computer languages. Second and third generation languages have programmers write source code, that is saved into source files. Those files are used by either a compiler or an interpreter to turn the source code into machine language.
de: In diesem Kapitel haben wir gelernt, was eine CPU ist und dass Computerbefehle einfach Zahlen sind, die in die CPU eingegeben werden. Wir haben etwas über Computersprachen der ersten, zweiten und dritten Generation gelernt. Bei Sprachen der zweiten und dritten Generation schreiben Programmierer Quellcode, der in Quelldateien gespeichert wird. Diese Dateien werden entweder von einem Compiler oder einem Interpreter verwendet, um den Quellcode in Maschinensprache umzuwandeln.

source: Some languages compile code to a set of instructions for a virtual machine, and the virtual machine can run on multiple different types of systems.
de: Einige Sprachen kompilieren Code zu einem Satz von Anweisungen für eine virtuelle Maschine, und die virtuelle Maschine kann auf mehreren verschiedenen Arten von Systemen laufen.

source: The language we are using for this class is called Python, it is one of the top five computer languages in use today.
de: Die Sprache, die wir für diesen Kurs verwenden, heißt Python und sie ist eine der fünf wichtigsten Computersprachen, die heute verwendet werden.

source: Review Questions
de: Fragen zur Überprüfung

source: What do we call the main "brain" of the computer where all the processing happens?
de: Wie nennt man das Haupt-"Gehirn" des Computers, in dem die gesamte Verarbeitung stattfindet?

source: Instructions for a CPU are made up of a long sequence of what?
de: Die Anweisungen für eine CPU bestehen aus einer langen Folge von was?

source: What is the name of the native language for CPUs?
de: Wie heißt die native Sprache für CPUs?

source: What is the difference between a CPU and a GPU?
de: Was ist der Unterschied zwischen einer CPU und einer GPU?

source: Commands with a GPU can be processed by hundreds or thousands of what?
de: Befehle mit einer GPU können von Hunderten oder Tausenden von was verarbeitet werden?

source: If machine language is a first-generation language, what is the second-generation language?
de: Wenn Maschinensprache eine Sprache der ersten Generation ist, was ist dann die Sprache der zweiten Generation?

source: What do we call the file that programmers type commands into?
de: Wie nennt man die Datei, in die Programmierer Befehle eintippen?

source: What is the name of the program that turns assembly language into machine language?
de: Wie heißt das Programm, das Assemblersprache in Maschinensprache umwandelt?

source: Third-generation languages usually fall into what three categories?
de: Sprachen der dritten Generation fallen normalerweise in welche drei Kategorien?

source: What is the difference between a compiler and an interpreter?
de: Was ist der Unterschied zwischen einem Compiler und einem Interpreter?

source: What generation of language is Python?
de: Welche Generation von Sprache ist Python?

source: What are some of the most popular languages in use today, according to the TIOBE Index?
de: Welche Sprachen sind heute, laut dem TIOBE-Index einige der am häufigsten im Einsatz/beliebtesten?
