Repository: Cubik65536/arcade_book
Catalog: locale/*/LC_MESSAGES/chapters/01_foreword/foreword.po
Languages: de

source: Foreword
de: Vorwort

source: This book teaches programming through creating 2D video games. It covers all the standard topics in a normal first-semester college class, but the projects are games. Video games provide great visual feedback for your code. Furthermore, programming can be *fun*.
de: Dieses Buch lehrt dir das Programmieren durch die Erstellung von 2D-Videospielen. Es deckt die gesamten Standartthemen eines normalen Collegekurses, des ersten Semesters, ab, die Projekte aber sind Videospiele. Denn Videospiele bieten dir ein großartiges visuelles Feedback für deinen Code. Zusätzlich kann programmieren *Spaß* machen.

source: Programming is consistently one of the top paid skills that you can learn. It is also one of the most flexible majors you can get. You can take your programming skills to almost any industry, and any location.
de: Programmieren ist stets eine gutbezahlte Fähigkeit, die du erlernen kannst. Außerdem ist es ein sehr flexibles Studienfach. Auch kannst du Programmierfähigkeiten in fast jeder Branche und an jedem Ort gebrauchen.

source: Even if programming isn't going to be your main job, as a skill it can still enhance your career. Need an interactive website? Need to crunch sales numbers? What about automatically saving experiment data and graphing results? Maybe you want your home to automatically e-mail you if the garage door is left open? Learning programming, be able to do this and more.
de: Selbst wenn Programmieren nicht dein Hauptberuf sein wird, kann diese Fähigkeit deiner Karriere helfen. Du brauchst eine interaktive Webseite? Musst Verkaufszahlen auswerten? Oder wie wäre es mit einen Programm für die automatischen Speicherung von Versuchsdaten und der grafischen Darstellung der Ergebnisse? Vielleicht möchtest du, dass dein Haus dir automatisch eine E-Mail schickt, wenn das Garagentor offen gelassen wurde? Programmieren zu lernen kann dir das alles und noch mehr ermöglichen.

source: Programming Is For Everyone
de: Programmieren ist für jeden

source: With programming you get to *create*. Making beautiful graphics and designing programs is an art. Good design requires people from all walks of life, and that's one of the reasons Apple was able to gain a foothold in the computing industry:
de: Beim Programmieren wirst du *kreativ*. Schöne Grafiken zu erstellen und Programme zu entwerfen ist eine Kunst. Für gutes Design braucht man Menschen aus allen Bereichen, und das ist einer der Gründe, warum Apple in der Computerbranche Fuß fassen konnte:

source: Picasso had a saying. He said, "Good artists copy, great artists steal." And we have always been shameless about stealing great ideas and I think part of what made the Macintosh great was that the people working on it were musicians and poets and artists and zoologists and historians who also happened to be the best computer scientists in the world.
de: Picasso hatte ein Sprichwort. Er sagte: "Gute Künstler kopieren, großartige Künstler stehlen." Und wir waren schon immer schamlos darin, großartige Ideen zu stehlen, und ich denke, ein Teil dessen, was den Macintosh groß gemacht hat, war, dass die Leute, die daran gearbeitet haben, Musiker und Dichter und Künstler und Zoologen und Historiker waren, die zufällig auch die besten Informatiker der Welt waren.

source: *Steve Jobs in PBS's "Triumph of the Nerds: The Rise of Accidental Empires" (1996)*
de: *Steve Jobs in der Sendung "Triumph of the Nerds: The Rise of Accidental Empires" (1996) auf PBS*

source: The artistry behind a program isn't just how it looks, but how it is *designed*. How the interface between the human and the computer functions:
de: Die Kunst hinter einem Programm ist nicht nur, wie es aussieht, sondern wie es *designt* ist. Wie die Schnittstelle zwischen dem Menschen und dem Computer funktioniert:

source: Design is a funny word. Some people think design means how it looks. But of course, if you dig deeper, it's really how it works. The design of the Mac wasn't what it looked like, although that was part of it. Primarily, it was how it worked.
de: Design ist ein seltsames Wort. Manche Leute denken, Design bedeutet, wie es aussieht. Aber wenn man tiefer gräbt, geht es natürlich darum, wie es wirklich funktioniert. Beim Design des Mac ging es nicht darum, wie er aussieht, obwohl das ein Teil davon war. In erster Linie ging es darum, wie er funktioniert.

source: *Steve Jobs in Wired's "The Next Insanely Great Thing" (1996)*
de: *Steve Jobs im Artikel in Wired "The Next Insanely Great Thing" (1996)*

source: Programming requires all kinds of people. Successful programs require idea people, business people, project people, artists, subject-matter experts, testers, writers, and more. You may not have ever thought of yourself as a programmer, but you *can* be.
de: Programmieren erfordert alle Arten von Menschen. Erfolgreiche Programme benötigen Ideengeber, Geschäftsleute, Projektleute, Künstler, Fachexperten, Tester, Autoren und mehr. Vielleicht hast du dich selbst noch nie als Programmierer gesehen, aber *du* kannst es sein.

source: Programming Pays Well
de: Programmieren wird gut bezahlt

source: Search up "top paid majors" and you'll see computer science is usually one of the best paying degrees you can get.
de: Such nach "bestbezahlte Hauptfächern" und du wirst sehen, dass Informatik in der Regel einer der am besten bezahlten Abschlüsse ist, den du bekommen kannst.

source: In 2020 the National Association of Colleges and Employers (NACE) says that `computer science majors are projected to have the highest starting salary <https://www.naceweb.org/job-market/compensation/computer-science-grads-projected-to-be-top-paid-in-major/>`_. Payscale agrees, says `computer science is second only to petroleum engineering <https://www.payscale.com/college-salary-report/majors-that-pay-you-back/bachelors>`_. Learning to program is worth your time.
de: Im Jahr 2020 sagt die National Association of Colleges and Employers (NACE), dass `Informatik Absolventen prognostiziert, das höchste Anfangsgehalt haben <https://www.naceweb.org/job-market/compensation/computer-science-grads-projected-to-be-top-paid-in-major/>`_ . Payscale stimmt dem zu und sagt, dass `Informatik an zweiter Stelle nach Erdöl-/Erdgastechnik liegt <https://www.payscale.com/college-salary-report/majors-that-pay-you-back/bachelors>`_. Programmieren zu lernen ist die Zeit wert.

source: What Can You Create By The End Of The Course?
de: Was kannst du am Ende dieses Kurses kreieren?

source: Here are some videos of games students have created in prior semesters. Students who didn't know any programming were able to create these games by the time they finished the semester.
de: Hier sind ein paar Videos von Spielen die Studenten in früheren Semestern erstellt haben. Studenten, die vorher nicht programmieren konnten, konnten diese Spiele am Ende ihres Semesters umsetzen
