Repository: Cubik65536/arcade_book
Catalog: locale/*/LC_MESSAGES/chapters/04_print_statement/print_statement.po
Languages: de

source: The Print Function
de: Die Print Funktion

source: `Link to video for this chapter. <https://youtu.be/6KaRu3FS3AA>`_
de: `Video Link für dieses Kapitel. <https://youtu.be/6KaRu3FS3AA>`_

source: Prior to this chapter we got our computer ready to start coding in :ref:`chapter-setup`. We did that by installing the Python programming language and an integrated development environment (IDE) called PyCharm. You can think of Python as the engine, and PyCharm as the interface to the engine.
de: Vor diesem Kapitel haben wir in :ref`Einrichten Deines Systems` unseren Computer für die Programmierung vorbereitet. Dazu haben wir die Programmiersprache Python und eine integrierte Entwicklungsumgebung (IDE) namens PyCharm installiert. Du kannst dir Python als den Motor und PyCharm als die Schnittstelle zum Motor vorstellen.

source: In :ref:`version-control` we began learning `git`. Version control systems allow us to share code, work on code in groups, and track changes to the code. We'll use that tool to track and share your code for every lab you write in this book.
de: Im Bereich :ref:`Versionskontrollsystem` haben wir begonnen, `git` zu lernen. Versionskontrollsysteme ermöglichen es uns, Codes gemeinsam zu nutzen, in Gruppen an Codes zu arbeiten und Änderungen am Code zu verfolgen. Wir werden dieses Werkzeug verwenden, um deinen Code für jedes Labor, das du in diesem Buch schreiben, zu verfolgen und zu teilen.

source: In this chapter we'll write our first programs using the most fundamental of all tools in the programmer's toolbox, the ``print`` function. This function does exactly what you'd expect--it prints to the screen.
de: In diesem Kapitel werden wir unsere ersten Programme schreiben und dabei das grundlegendste aller Werkzeuge im Werkzeugkasten des Programmierers verwenden, die ``print`` Funktion. Diese Funktion tut genau das, was du erwarten würdest--sie druckt auf den Bildschirm.

source: While a lot of programs are graphics-based, text-only programs are still quite common with people that manage computers, or who do data analytics. Even for the graphics-based games we develop in this book, the ``print`` function will be a vital aid in understanding and debugging our games.
de: Während viele Programme grafikbasiert sind, sind reine Textprogramme bei Leuten, die Computer verwalten oder sich mit Datenanalyse beschäftigen, immer noch recht häufig. Selbst für die grafikbasierten Spiele, die wir in diesem Buch entwickeln, wird die ``print`` Funktion ein wichtiges Hilfsmittel sein, um unsere Spiele zu verstehen und Fehler zu beseitigen.

source: We aren't limited to printing to the screen. Later on in :ref:`saving-high-score` we'll show how to print to a file so we can save data. Programs can even print over a network connection, which is the start of what's needed to learn how to do web programming.
de: Wir sind nicht auf das Drucken auf den Bildschirm beschränkt. Später in :ref: `Beispiel: Highscore speichern` werden wir zeigen, wie wir in eine Datei drucken können, um Daten zu speichern. Programme können sogar über eine Netzwerkverbindung drucken, was der Anfang dessen ist, was man braucht, um zu lernen, wie man Web-Programmierung macht.

source: Printing "Hello World"
de: Ein "Hello World" Programm drucken

source: We are going to use a **function** to output text to the screen. If you've taken a geometry class, you've already used the sine (**sin**) and cosine (**cos**) functions. In this chapter, we are going to use the **print** function.
de: Wir werden eine **Funktion** verwenden, um Text auf dem Bildschirm auszugeben. Wenn du einen Geometriekurs belegt hast, hast du bereits die Funktionen Sinus (**sin**) und Kosinus (**cos**) verwendet. In diesem Kapitel werden wir die Funktion **print** verwenden.

source: In programming, we use functions *a lot*. Functions are a basic building block in any computer program. Just like in math, when we use functions in programming we start with a **function name**, such as sin, cos, and print. Immediately after the function name is a pair of parentheses: ``( )``. We put any function **parameter** inside the parentheses.
de: In der Programmierung verwenden wir Funktionen *sehr häufig*. Funktionen sind ein grundlegender Baustein in jedem Computerprogramm. Genau wie in der Mathematik beginnen wir bei der Verwendung von Funktionen in der Programmierung mit einem **Funktionsnamen**, wie z. B. sin, cos und print. Unmittelbar nach dem Funktionsnamen folgt ein Paar Klammern: ``( )``. Wir setzen jeden Funktions**parameter** innerhalb der Klammern.

source: In the example below, we have a function, parenthesis, and a parameter:
de: Im folgenden Beispiel haben wir eine Funktion, eine Klammer und einen Parameter:

source: With a ``sin`` function, we put in an angle as our parameter. With the ``print`` function, we put the text we want to print as a parameter:
de: Bei einer ``sin``-Funktion geben wir einen Winkel als Parameter ein. Bei der ``print`` Funktion geben wir als Parameter den Text an, den wir ausdrucken wollen:

source: Text *must* be enclosed in quotes, we'll explain why later in the :ref:`expressions` chapter.
de: Text *muss* in Anführungszeichen eingeschlossen werden, wir werden später im Kapitel :ref:`Variablen und Ausdrücke` erklären, warum.

source: Entering Our Program
de: Einstieg in unser Programm

source: Now that we've seen what the ``print`` function looks like, let's use it to enter our first program.
de: Nachdem wir nun gesehen haben, wie die ``print`` Funktion aussieht, wollen wir sie benutzen, um unser erstes Programm zu starten.

source: The `Hello World`_ program is a simple program that just prints "Hello World" to the screen. It is often the first program any programmer creates in a new computer language.
de: Das Programm `Hello World`_ ist ein einfaches Programm, das nur "Hello World" auf den Bildschirm ausgibt. Es ist oft das erste Programm, das ein Programmierer in einer neuen Computersprache erstellt.

source: First, open PyCharm. From our work in :ref:`chapter-setup` and :ref:`version-control` we should already have our PyCharm and our project ready to go. You should be able to run PyCharm, and see a window like this:
de: Öffne zunächst PyCharm. Durch unsere Arbeit in :ref:`Einrichten deines Systems` und :ref:`Versionskontrollsysteme` sollten wir PyCharm und unser Projekt bereits einsatzbereit haben. Du solltest in der Lage sein, PyCharm zu starten und ein Fenster wie dieses zu sehen:

source: PyCharm window ready for coding.
de: PyCharm-Fenster bereit für die Codierung.

source: First click the triangle next to your project name (1), then find ``Testing``, (2) then finally ``test.py`` (3).
de: Klick zuerst auf das Dreieck neben deinem Projektnamen (1), dann auf ``Testing``, (2) und schließlich auf ``test.py`` (3).

source: The most frequent mistake here is to have PyCharm opened to the wrong folder. Make sure your all lab folders appear inside the ``learn_arcade`` folder. If they don't, select the File...Open menu and reselect your project folder as shown in :ref:`open-in-pycharm`. Once selected you should not have to do a File...Open again for the rest of the book.
de: Der häufigste Fehler ist hier, dass PyCharm im falschen Ordner geöffnet ist. Vergewissern Sie sich, dass alle Lab-Ordner innerhalb des ``learn_arcade``-Ordners erscheinen. Wenn das nicht der Fall ist, dann wähl das Menü File...Open und wähl deinen Projektordner erneut aus, wie in :ref:`Projekt in PyCharm öffnen` gezeigt. Einmal ausgewählt, solltest du für den Rest des Buches kein File...Open mehr machen müssen.

source: Once you've selected ``test.py``, go ahead and type in your first program:
de: Sobald du ``test.py`` ausgewählt hast, kannst du dein erstes Programm eintippen:

source: Running Our Program
de: Unser Programm ausführen

source: After you've typed in your program, right-click on either ``print_statements.py`` or anywhere in the code window and select ``Run 'print_statements.py'``
de: Nachdem du dein Programm eingegeben hast, klick mit der rechten Maustaste entweder auf ``print_statements.py`` oder auf eine beliebige Stelle im Codefenster und wähl ``Run 'print_statements.py'``

source: Right click on your program, then select run.
de: Klick mit der rechten Maustaste auf dein Programm und wähl dann run.

source: You should see the output from your program appear in a window at the bottom of your computer:
de: Du solltest die Ausgabe deines Programms in einem Fenster am unteren Rand deines Computers erscheinen sehen:

source: Output of our Hello World program.
de: Ausgabe unseres Hello World-Programms.

source: Errors and Warnings
de: Fehler und Warnungen

source: Programs don't always work on the first try. In fact, they rarely do. As programmers, we run programs over and over until we find the right code.
de: Programme funktionieren nicht immer beim ersten Versuch. Tatsächlich tun sie das selten. Als Programmierer führen wir Programme immer und immer wieder aus, bis wir den richtigen Code finden.

source: If the computer runs into an error that it doesn't know how to handle, it will generate an error and stop. Don't panic, it's no big deal. We'll fix it.
de: Wenn der Computer auf einen Fehler stößt, von dem er nicht weiß, wie er ihn beheben kann, wird er eine Fehlermeldung erzeugen und anhalten. Keine Panik, das ist keine große Sache. Wir werden es beheben.

source: In addition to errors where the program doesn't run at all, Python can show us *warnings*. Warnings occur when the code runs, but something isn't "perfect."
de: Zusätzlich zu Fehlern, bei denen das Programm überhaupt nicht läuft, kann Python uns *Warnungen* anzeigen. Warnungen treten auf, wenn der Code zwar läuft, aber etwas nicht "perfekt" ist.

source: Errors
de: Fehler

source: Let's create an error. Change the ``print`` function to use a capital ``P``: ``Print``.
de: Lass uns einen Fehler erzeugen. Ändere die ``print`` Funktion so, dass ein großes ``P`` verwendet wird: ``Print``.

source: Run the program. You should get something like this:
de: Führ das Programm aus. Du solltest so etwas erhalten:

source: Traceback (most recent call last): File "C:/Users/myusername/Documents/learn_arcade/Scratch Work/print_statements.py", line 1, in <module> Print("Hello World!") NameError: name 'Print' is not defined Process finished with exit code 1
de: Traceback (most recent call last): File "C:/Users/myusername/Documents/learn_arcade/Scratch Work/print_statements.py", line 1, in Print("Hello World!")NameError: name 'Print' is not definedProcess finished with exit code 1

source: All computer programs return a number called an *exit code* when they are done running. An exit code of 0 means the program ran without an error, any other number is a signal something went wrong. It is possible to write a program that runs other programs automatically, and this exit code is used to track if there was an error.
de: Alle Computerprogramme geben eine Zahl zurück, die *Exit-Code* genannt wird, wenn sie fertig gelaufen sind. Ein Exit-Code von 0 bedeutet, dass das Programm ohne Fehler gelaufen ist, jede andere Zahl ist ein Signal, dass etwas schief gelaufen ist. Es ist möglich, ein Programm zu schreiben, das andere Programme automatisch ausführt, und dieser Exit-Code wird verwendet, um zu verfolgen, ob es einen Fehler gab.

source: While it may look confusing, Python is telling you that on line 1 of your ``print_statements.py`` program it encountered a function named ``Print`` with a capital ``P``. But that function has not yet been "defined."
de: Es mag verwirrend aussehen, aber Python teilt dir mit, dass es in Zeile 1 deines Programms ``print_statements.py`` auf eine Funktion namens ``Print`` mit einem großen ``P`` gestoßen ist, die aber noch nicht "definiert" wurde.

source: Python is case-sensitive, which means ``print`` with a lower-case ``p`` and ``Print`` with an upper-case ``P`` are as different as apples and oranges to the computer. The lower-case ``print`` function is built into the language, and Python knows exactly what to do with it. The upper-case ``Print`` function is not built into the language, and Python complains with a ``NameError`` that it doesn't know what this function is.
de: Python unterscheidet zwischen Groß- und Kleinschreibung, was bedeutet, dass ``print`` mit einem kleinen ``p`` und ``Print`` mit einem großen ``P`` für den Computer so unterschiedlich sind wie Äpfel und Birnen. Die Funktion ``print`` mit Kleinbuchstaben ist in die Sprache eingebaut, und Python weiß genau, was damit zu tun ist. Die ``Print`` Funktion mit Großbuchstaben ist nicht in die Sprache eingebaut, und Python beschwert sich mit einem ``NameError``, dass es nicht weiß, was diese Funktion ist.

source: Let's try a different error. Go back to using ``print`` with a lower case ``p``, but remove the parentheses:
de: Versuchen wir einen anderen Fehler. Geh zurück zur Verwendung von ``print`` mit einem kleingeschriebenen ``p``, aber entferne die Klammern:

source: When you run the program now, you'll get:
de: Wenn du das Programm jetzt ausführst, erhältst du:

source: This is a different type of error, a *syntax error*. The term *syntax* originates with human languages, not computer languages. Both human and computer languages have an expected structure to them. A statement in English can take the form of a noun followed by a verb. "Rob runs." is a valid statement, while "Runs Rob." is not. The computer expects a function name to be followed by parentheses. If your program doesn't follow that pattern, it generates a syntax error.
de: Dies ist eine andere Art von Fehler, ein *Syntaxfehler*. Der Begriff *Syntax* stammt von menschlichen Sprachen, nicht von Computersprachen. Sowohl menschliche Sprachen als auch Computersprachen weisen eine erwartete Struktur auf. Eine Aussage im Englischen kann die Form eines Substantivs gefolgt von einem Verb haben. "Rob läuft." ist eine gültige Anweisung, während "Läuft Rob." keine ist. Der Computer erwartet, dass ein Funktionsname von Klammern gefolgt wird. Wenn dein Programm diesem Muster nicht folgt, erzeugt es einen Syntaxfehler.

source: The type of error and the line number are both important clues on how to solve the mystery what caused the bug.
de: Die Art des Fehlers und die Zeilennummer sind beides wichtige Anhaltspunkte, um das Rätsel zu lösen, was den Fehler verursacht hat.

source: Warnings
de: Warnungen

source: It can be possible to write code that runs, but isn't quite perfect. For example, let's take our Hello World program and add some extra spaces:
de: Es kann möglich sein, einen Code zu schreiben, der zwar läuft, aber nicht ganz perfekt ist. Nehmen wir zum Beispiel unser Hello World-Programm und fügen ein paar zusätzliche Leerzeichen hinzu:

source: Go ahead and run the program. It should run without any errors.
de: Fahre fort und führ das Programm aus. Es sollte ohne Fehler laufen.

source: The Python standard is to have *no* spaces between the function name and the opening parenthesis. However, this code is "close enough" that the computer can run fine with no errors. In English, if we go to a store and ask "I'd like to buy one apples please," our sentence isn't grammatically correct. It is close enough anyone could figure out the intent.
de: Der Python-Standard ist es, *keine* Leerzeichen zwischen dem Funktionsnamen und der öffnenden Klammer zu haben. Dieser Code ist jedoch "nah genug dran", dass der Computer das Programm ohne Fehler ausführen kann. Wenn wir im Englischen in einen Laden gehen und fragen: "I'd like to buy one apples please", ist unser Satz grammatikalisch nicht korrekt. Er ist aber nahe genug, dass jeder die Absicht herausfinden kann.

source: Python has a *style-guide* which lays out how to format your code properly. This style-guide is called `PEP-8`_.
de: Python hat einen *Style-Guide*, der festlegt, wie man seinen Code richtig formatiert. Dieser Style-Guide heißt ``PEP-8``_.

source: Why fix warnings? When finding errors in code, programmers spend a lot of time looking for things that are out of place. If all code is formatted the same way it is easier to scan looking for problems. Any inconsistency forces a programmer's brain to stop and figure out if it is important. Removing those inconsistencies makes debugging easier.
de: Warum Warnungen beheben? Beim Finden von Fehlern im Code verbringen Programmierer viel Zeit damit, nach Dingen zu suchen, die nicht passen. Wenn der gesamte Code gleich formatiert ist, ist es einfacher, ihn auf der Suche nach Problemen zu durchsuchen. Jede Inkonsistenz zwingt das Gehirn eines Programmierers dazu, innezuhalten und herauszufinden, ob sie wichtig ist. Die Beseitigung dieser Inkonsistenzen erleichtert die Fehlerbehebung.

source: You can find warnings in your code using PyCharm by looking at the right margin. Any yellow line is a warning. You can hover over it with your mouse to find the details.
de: Du kannst Warnungen in deinem Code mit PyCharm finden, indem du dir den rechten Rand ansiehst. Jede gelbe Linie ist eine Warnung. Du kannst mit der Maus darüber fahren, um die Details zu erfahren.

source: Warnings are highlighted by yellow lines on the right side of the screen.
de: Warnungen werden durch gelbe Linien auf der rechten Seite des Bildschirms hervorgehoben.

source: Another warning you might encounter in your first program is the Python style guide states all programs are supposed to have exactly one blank line at the end of the file. If you get into the habit of fixing these warnings, you'll learn to write code that will be easier to maintain.
de: Eine weitere Warnung, auf die du in deinem ersten Programm stoßen könntest, ist, dass der Python-Styleguide besagt, dass alle Programme genau eine Leerzeile am Ende der Datei haben sollen. Wenn du es dir angewöhnst, diese Warnungen zu beheben, wirst du lernen, einen Code zu schreiben, der leichter beizubehalten sein wird.

source: Warnings are not just about style. You might also get a warning about an error that could occur before you run the program. For example, if instead of passing a number to the ``sin()`` function, you might have written code that passes in text.
de: Warnungen beziehen sich nicht nur auf den Style. Sie könnten auch eine Warnung über einen Fehler erhalten, der auftreten könnte, bevor Sie das Programm ausführen. Wenn du zum Beispiel eine Zahl an die ``sin()``-Funktion weitergibst, könntest du Code geschrieben haben, der Text statt Zahlen weitergibt.

source: *Weak warnings* are warnings that are mostly just about style or aren't as likely to end up being errors. *Strong warnings* are code the computer feels probably points to a bug that will end up being an error.
de: *Schwache Warnungen* sind Warnungen, bei denen es meist nur um den Style geht oder die nicht so wahrscheinlich sind, dass sie sich als Fehler herausstellen. *Starke Warnungen* sind Codes, von denen der Computer glaubt, dass sie wahrscheinlich auf einen Bug hinweisen, der sich als Fehler herausstellen wird.

source: Multiple Print Lines
de: Mehrere Druckzeilen

source: We aren't limited to one ``print`` statement. We can print multiple lines of text with multiple lines of code. Let's change our Hello World program to the cliché opener for melodramatic fiction:
de: Wir sind nicht auf eine ``print`` Anweisung beschränkt. Wir können mehrere Textzeilen mit mehreren Codezeilen drucken. Lass uns unser "Hello World"-Programm in den klischeehaften Einstieg einer melodramatische Fiktion verwandeln:

source: print("It was a dark and stormy night.") print("Suddenly a shot rang out!")
de: print("Es war eine dunkle und stürmige Nacht.") print("Plötzlich ertönte ein Schuss!")

source: Your output should look like:
de: Deine Ausgabe sollte wie folgt aussehen:

source: It was a dark and stormy night. Suddenly a shot rang out!
de: Es war eine dunkle und stürmige Nacht. Plötzlich ertönte ein Schuss

source: If quotes are used to tell the computer the start and end of the string of text you wish to print, how does a program print out a set of double quotes?
de: Wenn Anführungszeichen verwendet werden, um dem Computer den Anfang und das Ende der zu druckenden Textzeichenfolge mitzuteilen, wie druckt ein Programm dann eine Reihe von doppelten Anführungszeichen aus?

source: A double-quote is not two quote marks.
de: Ein doppeltes Anführungszeichen sind nicht zwei Anführungszeichen.

source: This is a double quote: ``"``
de: Dies ist ein doppeltes Anführungszeichen: ``"``

source: This is a single quote: ``'``
de: Das ist ein einfaches Anführungszeichen: ``'``

source: This is two double quote marks: ``" "``
de: Dies sind zwei doppelte Anführungszeichen: ``" "``

source: This code doesn't work:
de: Dieser Code funktioniert nicht:

source: print("Hi! This is a double quote mark: " We use it for printing.")
de: print("Hi! Das ist ein doppeltes Anführungszeichen: " Wir benutzen es zum drucken.")

source: If we try to run it, we get a syntax error:
de: Wenn wir versuchen, es auszuführen, erhalten wir einen Syntaxfehler:

source: File "S:/Webserver/arcade_book/test.py", line 1 print("Hi! This is a double quote mark: " We use it for printing.") ^ SyntaxError: invalid syntax
de: File "S:/Webserver/arcade_book/test.py", line 1 print("Hi! Das ist ein doppeltes Anführungszeichen: " Wir benutzen es zum drucken.") ^SyntaxError: invalid syntax

source: The computer looks at the quote in the middle of the string and thinks that is the end of the text. Then it has no idea what to do with the text after the quote. It doesn't expect text after a closing quote, so we end up with an error.
de: Der Computer sieht sich das Anführungszeichen in der Mitte der Zeichenfolge an und denkt, dass dies das Ende des Textes ist. Dann hat er keine Ahnung, was er mit dem Text nach dem Anführungszeichen machen soll. Er erwartet keinen Text nach einem schließenden Anführungszeichen, so dass wir mit einem Fehler enden.

source: It is necessary to tell the computer that we want to treat that middle double quote as text, not as a quote ending the string. To do this, we need to use an **escape code**. An escape code is a sequence of characters that can be used to print an otherwise unprintable characters.
de: Es ist notwendig, dem Computer mitzuteilen, dass wir das mittlere doppelte Anführungszeichen als Text behandeln wollen und nicht als ein Anführungszeichen, das die Zeichenkette beendet. Um dies zu tun, müssen wir einen **Escape-Code** verwenden. Ein Escape-Code ist eine Folge von Zeichen, die verwendet werden kann, um ein ansonsten nicht druckbares Zeichen auszugeben.

source: All escape codes in Python start with a backslash: ``\``. (A backslash leans backwards. A forward slash ``/`` leans forward.) The escape code for a double quote is ``\"``:
de: Alle Escape-Codes in Python beginnen mit einem Backslash: ``\``. (Ein Backslash lehnt sich nach hinten, ein Schrägstrich ``/`` lehnt sich nach vorne.) Der Escape-Code für ein doppeltes Anführungszeichen ist ``\"``:

source: print("Hi! This is a double quote mark: \" We use it for printing.")
de: print("Hallo! Dies ist ein doppeltes Anführungszeichen: \" Wir verwenden es zum Drucken.")

source: If we run this code, it does not print the backslash, nor does it error. We get:
de: Wenn wir diesen Code ausführen, wird der Backslash nicht gedruckt, und es tritt auch kein Fehler auf. Wir erhalten:

source: Hi! This is a double quote mark: " We use it for printing.
de: Hallo! Dies ist ein doppeltes Anführungszeichen: " Wir verwenden es zum Drucken.

source: Almost every language has escape codes, and many of them (C, C#, Java) use backslashes just like Python.
de: Fast jede Sprache hat Escape-Codes, und viele von ihnen (C, C#, Java) verwenden Backslashes genau wie Python.

source: Here's another example:
de: Hier ist ein weiteres Beispiel:
