Repository: Cubik65536/arcade_book
Catalog: locale/*/LC_MESSAGES/chapters/04_print_statement/print_statement.po
Languages: de

source: print("Audrey Hepburn once said \"Nothing is impossible. The word itself says 'I'm Possible!'.\"")
de: print("Audrey Hepburn sagte einmal \"Nothing is impossible. The word itself says 'I'm Possible!'.\"")

source: This will print:
de: Das wird folgendes drucken:

source: Audrey Hepburn once said "Nothing is impossible. The word itself says 'I'm Possible!'."
de: Audrey Hepburn sagt einmal "Nothing is impossible. The word itself says 'I'm Possible!'."

source: Because the backslash is used as part of an escape code, the backslash itself must be escaped if you want to use one. For example, this code does not work correctly:
de: Da der Backslash als Teil eines Escape-Codes verwendet wird, muss der Backslash selbst escaped werden, wenn Sie einen verwenden möchten. Dieser Code funktioniert zum Beispiel nicht korrekt:

source: print("The file is stored in C:\new folder")
de: print("Die Datei ist in C:\new folder gespeichert")

source: Why? Because ``\n`` is an escape code. To print the backslash it is necessary to escape it like so:
de: Warum? Weil ``\n`` ein Escape-Code ist. Um den Backslash zu drucken, ist es notwendig, ihn wie folgt zu escapen:

source: print("The file is stored in C:\\new folder")
de: print("Die Datei ist im Ordner C:\\new gespeichert")

source: There are a few other important escape codes to know. Here is a table of the important escape codes:
de: Es gibt noch ein paar andere wichtige Escape-Codes, die du kennen solltest. Hier findest du eine Tabelle mit den wichtigen Escape-Codes:

source: Description
de: Beschreibung

source: Single Quote
de: Einzelnes Zitat

source: Double Quote
de: Doppeltes Zitat

source: Carriage Return (Abbreviated as CR, move cursor to the left)
de: Carriage Return (Abgekürzt als CR, Cursor nach links bewegen)

source: Linefeed (Abbreviated as LF, move cursor down)
de: Linefeed (Abgekürzt als LF, Cursor nach unten bewegen)

source: What is a "Carriage Return" and a "Linefeed"? Try this example:
de: Was ist ein "Carriage Return" und ein "Linefeed"? Versuchen Sie dieses Beispiel:

source: print("This\nis\nmy\nsample.")
de: print("Das\nist\nmein\nBeispiel.")

source: The output from this command is:
de: Die Ausgabe dieses Befehls ist:

source: This is my sample.
de: Das ist mein Beispiel

source: The ``\n`` is a linefeed. It moves "cursor" where the computer will print text down one line. The computer stores all text in one big long line. It knows to display the text on different lines because of the placement of ``\n`` characters.
de: Das ``\n`` ist ein Zeilenvorschub. Es bewegt den "Cursor" an die Stelle, an der der Computer den Text eine Zeile nach unten drucken wird. Der Computer speichert den gesamten Text in einer großen, langen Zeile. Er weiß aufgrund der Platzierung der ``\n``-Zeichen, dass er den Text in verschiedenen Zeilen anzeigen muss.

source: Before the Internet became commonplace, computers didn't agree on what characters to use for line endings:
de: Bevor das Internet alltäglich wurde, waren sich die Computer nicht einig, welche Zeichen sie für Zeilenenden verwenden sollten:

source: LF: UNIX based systems, and newer Macs.
de: LF: UNIX-basierte Systeme und neuere Macs.

source: CR: Older Mac based systems
de: CR: Ältere Mac-basierte Systeme

source: Having different standards was annoying when computers were connected on a network. The post-internet standard is to use ``\n`` for line endings.
de: Unterschiedliche Standards zu haben, war lästig, wenn Computer in einem Netzwerk verbunden waren. Der Post-Internet-Standard ist, ``\n`` für Zeilenenden zu verwenden.

source: If you use an escape code, don't put spaces around it. Don't, unless, you want spaces to be there. For example, this code might look better:
de: Wenn du einen Escape-Code verwendest, setze keine Leerzeichen darum. Tun es nicht, es sei denn, du möchtest, dass Leerzeichen vorhanden sind. Zum Beispiel könnte dieser Code besser aussehen:

source: print("This \n is \n my \n sample.")
de: print("Das \n ist \n mein \n Beispiel.")

source: But it will print with extra spaces before the words:
de: Aber es wird mit zusätzlichen Leerzeichen vor den Wörtern gedruckt:

source: This is my sample.
de: Das ist mein Beispiel

source: Just because you *can* use a ``\n`` to print multiple lines in a single ``print`` statement doesn't mean you should. Often it is easier to read two short ``print`` statements rather than one super-long ``print`` statement with a bunch of ``\n`` escape codes crammed into it.
de: Nur weil du ein ``\n`` verwenden *kannst*, um mehrere Zeilen in einer einzigen ``print`` Anweisung zu drucken, heißt das nicht, dass du das auch tun solltest. Oft ist es einfacher, zwei kurze ``print`` Anweisungen zu lesen als eine superlange ``print`` Anweisung mit einem Haufen ``\n``-Escape-Codes, die darin eingepfercht sind.

source: Triple Quotes
de: Dreifache Zitate

source: If you have a block of text and don't want to spend a lot of time putting quotes around each line, you can use triple quotes.
de: Wenn du einen Textblock hast und nicht viel Zeit damit verbringen möchtest, Anführungszeichen um jede Zeile zu setzen, kannst du dreifache Anführungszeichen verwenden.

source: print("""You can print on multiple lines using triple quotes.""")
de: print("""Du kannst mit dreifachen Anführungszeichen auf mehreren Zeilen drucken.""")

source: This code will run and print out like this:
de: Dieser Code wird ausgeführt und wie folgt ausgedruckt:

source: You can print on multiple lines using triple quotes.
de: Du kannst mit dreifachen Anführungszeichen auf mehreren Zeilen drucken.

source: It is tempting to put in extra blank lines and indents. Don't do this unless you want them in the final output. For example, the code in this example looks better than the code in the previous example:
de: Es ist verlockend, zusätzliche Leerzeilen und Einzüge einzufügen. Tu das nicht, es sei denn, du möchtest sie in der endgültigen Ausgabe haben. Der Code in diesem Beispiel sieht zum Beispiel besser aus als der Code im vorherigen Beispiel:

source: print("""You can print on multiple lines using triple quotes.""")
de: print("""Du kannst mit dreifachen Anführungszeichen auf mehrere Zeilen drucken.""")

source: But the output will include all those extra spaces:
de: Aber die Ausgabe enthält all diese zusätzlichen Leerzeichen:

source: You can print on multiple lines using triple quotes.
de: Du kannst mit dreifachen Anführungszeichen auf mehrere Zeilen drucken.

source: In this chapter we learned one of the most basic building blocks of a computer program is the **function**. The first function we are learning about is the ``print`` function, used to output information to the screen. We learned how to use that function by entering and running our first program. As programs don't always work the first try, we learned about **name errors** and **syntax errors**. We learned that code has a style guide called **PEP-8** that defines how code should be formatted. Printing multiple lines is possible using three techniques: multiple print statements, **escape codes**, and **triple-quotes**. We learned that escape codes can also be used to print quotes and tab characters.
de: In diesem Kapitel haben wir gelernt, dass einer der grundlegendsten Bausteine eines Computerprogramms die **Funktion** ist. Die erste Funktion, die wir kennenlernen, ist die ``print`` Funktion, mit der Informationen auf dem Bildschirm ausgegeben werden. Wir haben gelernt, wie man diese Funktion verwendet, indem wir unser erstes Programm eingegeben und ausgeführt haben. Da Programme nicht immer beim ersten Versuch funktionieren, haben wir etwas über **Namensfehler** und **Syntaxfehler** gelernt. Wir haben gelernt, dass es für Codes einen Styleguide namens **PEP-8** gibt, der festlegt, wie der Code formatiert werden sollte. Das Drucken mehrerer Zeilen ist mit drei Techniken möglich: mehrere Druckanweisungen, **Escape-Codes** und **dreifache Anführungszeichen**. Wir haben gelernt, dass Escape-Codes auch zum Drucken von Anführungszeichen und Tabulatorzeichen verwendet werden können.

source: Review Questions
de: Review Fragen

source: What type of error (looking for one word) are we likely to get, if we mistype a function name?
de: Welche Art von Fehler (Suche nach einem Wort) erhalten wir wahrscheinlich, wenn wir einen Funktionsnamen falsch schreiben?

source: If you forget to use parentheses when using a function, what type of error will you get (looking for one word)?
de: Welche Art von Fehler (Suche nach einem Wort) erhältst du, wenn du bei der Verwendung einer Funktion vergisst, Klammern zu verwenden?

source: What term refers to the values between the parentheses in function?
de: Welcher Begriff bezieht sich auf die Werte zwischen den Klammern in einer Funktion?

source: What is the escape code for a double quote?
de: Wie lautet der Escape-Code für ein doppeltes Anführungszeichen?

source: What escape code is most commonly used to go to a new line?
de: Welcher Escape-Code wird am häufigsten verwendet, um zu einer neuen Zeile zu wechseln?

source: What will this print? ``print("Escape codes: \\\\")``
de: Was wird damit gedruckt? ``print("Escape-Codes: \\\\")``

source: What do you use to print a block of text without using multiple print statements or ``\n``?
de: Was verwendest du, um einen Textblock zu drucken, ohne mehrere Druckanweisungen oder ``\n`` zu verwenden?

source: Write code to print ``Hello``.
de: Schreiben Sie einen Code, um ``Hallo`` zu drucken.

source: What is the name of the style-guide for Python?
de: Wie lautet der Name des Style-Guides für Python?

source: Online Coding Problems
de: Online-Kodierprobleme

source: Practice on-line by completing the first set of coding problems available here:
de: Übe on-line, indem du den ersten Satz von Kodierproblemen erledigst, der hier verfügbar ist:

source: All problems beginning with ``01`` can be done with the knowledge from this chapter.
de: Alle Probleme, die mit ``01`` beginnen, können mit dem Wissen aus diesem Kapitel bearbeitet werden.

source: Lab 1: First Program
de: Übung 1: Erstes Programm

source: Use the computer that you've set up in :ref:`chapter-setup` and the set of files you cloned in :ref:`version-control` to create your first program in :ref:`lab-01`. Then learn to commit the code to the version control system and turn it in.
de: Verwende den Computer, den du in :ref:`Einrichten des Systems` eingerichtet hast, und den Satz von Dateien, den du in :ref:`Versionskontrollsysteme` geklont haben, um Ihr erstes Programm in :ref:`Übung 1: Ein erstes Programm`zu erstellen. Lern dann, den Code an das Versionskontrollsystem zu übertragen und ihn abzugeben.
